export const dx = [
  {
    'title': '1、在企业网络中，哪种措施有助于防止内部威胁（  ）',
    'option': [
      'A、仅允许外部访问',
      'B、定期的员工安全培训和意识提升',
      'C、禁止所有内部通信',
      'D、忽略员工的安全行为'
    ],
    'value': 'B'
  },
  {
    'title': '2、网络安全法规的主要作用是（  ）',
    'option': [
      'A、限制网络技术的发展',
      'B、规范网络行为，保护网络安全',
      'C、增加网络管理的复杂性',
      'D、阻碍网络安全研究的进展'
    ],
    'value': 'B'
  },
  {
    'title': '3、以下哪种加密技术使用单个密钥进行加密和解密？（  ）',
    'option': [
      'A、对称加密',
      'B、非对称加密',
      'C、哈希函数',
      'D、数字签名'
    ],
    'value': 'A'
  },
  {
    'title': '4、数字签名不能实现的安全特性为（  ）',
    'option': [
      'A、防抵赖',
      'B、防伪造',
      'C、防冒充',
      'D、保密通信'
    ],
    'value': 'D'
  },
  {
    'title': '5、设计数据安全保障方案时，以下哪个做法是错误的（  ）',
    'option': [
      'A、要充分切合数据安全需求并且实际可行',
      'B、要充分考虑成本效益，在满足合规性要求和风险处置要求的前提下，尽量控制成本',
      'C、要充分采取最新技术，例如积极采用基于声纹识别进行身份验证',
      'D、要充分考虑用户管理和文化的可接受性，减少系统方案实施障碍'
    ],
    'value': 'C'
  },
  {
    'title': '6、Windows操作系统的注册表运行命令是（  ）',
    'option': [
      'A、Regsvr32',
      'B、Regedit',
      'C、Regedit.msc',
      'D、Regedit.mmc'
    ],
    'value': 'B'
  },
  {
    'title': '7、在Windows文件系统中，哪种支持文件加密（  ）',
    'option': [
      'A、FAT16',
      'B、NTFS',
      'C、FAT32',
      'D、EXT3'
    ],
    'value': 'B'
  },
  {
    'title': '8、操作系统安全的基础是建立在（  ）',
    'option': [
      'A、安全安装',
      'B、安全配置',
      'C、安全管理',
      'D、以上都对'
    ],
    'value': 'D'
  },
  {
    'title': '9、软件漏洞有可能被黑客利用之后进行提权与数据窃密，请问漏洞产生的原因不包括以下哪一点（  ）',
    'option': [
      'A、软件代码复杂性',
      'B、缺少充分的测试',
      'C、引用的开源组件/框架自身存在脆弱性',
      'D、攻击者的恶意利用'
    ],
    'value': 'D'
  },
  {
    'title': '10、当前大多手机终端支持指纹解锁，与传统的基于口令的鉴别技术相比，关于此种鉴别技术说法不正确的是（  ）',
    'option': [
      'A、指纹便于收集、测量和比较，该系统加强了身份验证强度的同时也提升了便利性',
      'B、每个人所拥有的指纹都是独一无二的',
      'C、指纹信息是每个人独有的，具备唯一性，因此该系统没有安全问题',
      'D、该系统一般由指纹采集和指纹识别两部分组成'
    ],
    'value': 'C'
  },
  {
    'title': '11、以下关于数据安全的预防措施或意识，说法错误的是（  ）',
    'option': [
      'A、尽量不要连接公共免费wifi',
      'B、移动硬盘拷贝数据前先进行病毒查杀',
      'C、关闭高危端口，最小化权限',
      'D、邮件内的可执行文件需要双击确认是否能运行，如果不能需要找发件人请求重新发送'
    ],
    'value': 'D'
  },
  {
    'title': '12、哪项技术用于在网络中检测和防止未经授权的访问？（  ）',
    'option': [
      'A、入侵检测系统（IDS）',
      'B、防火墙',
      'C、杀毒软件',
      'D、虚拟专用网络（VPN）'
    ],
    'value': 'A'
  },
  {
    'title': '13、以下哪种攻击方式通常用于获取目标系统的管理员权限（  ）',
    'option': [
      'A、权限提升攻击',
      'B、钓鱼攻击',
      'C、跨站脚本攻击（XSS）',
      'D、分布式拒绝服务攻击（DDoS）'
    ],
    'value': 'A'
  },
  {
    'title': '14、下列哪种加密技术属于对称加密（  ）',
    'option': [
      'A、RSA',
      'B、AES',
      'C、DSA',
      'D、ECC'
    ],
    'value': 'B'
  },
  {
    'title': '15、网络安全从业人员在进行安全检测时，应首先确保什么（  ）',
    'option': [
      'A、检测结果的准确性',
      'B、客户的业务连续性',
      'C、获得客户的明确授权',
      'D、使用的工具先进性'
    ],
    'value': 'C'
  },
  {
    'title': '16、根据网络安全道德规范，从业人员应如何对待知识产权（  ）',
    'option': [
      'A、随意使用，无需授权',
      'B、尊重并遵守知识产权法律法规',
      'C、只使用国外的知识产权',
      'D、忽略知识产权问题，只关注技术实现'
    ],
    'value': 'B'
  },
  {
    'title': '17、对全球重点国家的数据跨境转移要求划分成高中低风险，依据风险的高低即合规措施模式对各国家/地区进行归类分级，并给每一等级的国家适配统一的合规措施，最终形成包含合规措施的数据跨境传输风险矩阵，不包括下列哪一等级（  ）',
    'option': [
      'A、严格管控',
      'B、适度管控',
      'C、宽松管控',
      'D、谨慎管控'
    ],
    'value': 'D'
  },
  {
    'title': '18、在处理网络安全事件时，从业人员应首先考虑什么（  ）',
    'option': [
      'A、事件的技术难度',
      'B、事件的社会影响',
      'C、事件的法律责任',
      'D、事件的政治背景'
    ],
    'value': 'C'
  },
  {
    'title': '19、下列哪项不属于网络安全行业的职业道德（  ）',
    'option': [
      'A、保护用户隐私',
      'B、追求技术极致',
      'C、维护网络信息安全',
      'D、防止信息泄露'
    ],
    'value': 'B'
  },
  {
    'title': '20、若数据处理者未按照相应监管要求进行数据跨境传输，视情节轻重可能受到下列哪些处罚（  ）',
    'option': [
      'A、警告',
      'B、罚款、停业整顿',
      'C、吊销相关业务许可证或吊销营业执照',
      'D、以上都是'
    ],
    'value': 'D'
  },
  {
    'title': '21、网络安全是指（  ）',
    'option': [
      'A、保护计算机硬件不被破坏',
      'B、保护网络系统中的数据和信息不被未经授权的访问、使用、泄露、破坏、修改或销毁',
      'C、确保计算机运行速度',
      'D、以上都不是'
    ],
    'value': 'B'
  },
  {
    'title': '22、以下哪项不是网络安全的基本原则（  ）',
    'option': [
      'A、最小权限原则',
      'B、数据完整性原则',
      'C、信息隐藏原则',
      'D、保密性原则'
    ],
    'value': 'C'
  },
  {
    'title': '23、在网络安全中，以下哪项不是一种常见的防御策略（  ）',
    'option': [
      'A、防火墙',
      'B、入侵检测系统',
      'C、加密技术',
      'D、社交媒体营销'
    ],
    'value': 'D'
  },
  {
    'title': '24、当前网络安全面临的最大挑战之一是（  ）',
    'option': [
      'A、计算机硬件升级困难',
      'B、网络安全法规不完善',
      'C、高级持续性威胁',
      'D、网络速度过慢'
    ],
    'value': 'C'
  },
  {
    'title': '25、关于网络安全的发展趋势，以下哪项描述是正确的（  ）',
    'option': [
      'A、网络攻击越来越少',
      'B、网络安全技术越来越简单',
      'C、网络安全法规越来越严格',
      'D、网络安全问题不再重要'
    ],
    'value': 'C'
  },
  {
    'title': '26、在网络安全策略中，采用强密码的作用是（  ）',
    'option': [
      'A、提高计算机性能',
      'B、防止数据丢失',
      'C、增加网络带宽',
      'D、提高账户安全性'
    ],
    'value': 'D'
  },
  {
    'title': '27、哪项措施对于预防数据泄露最为关键（  ）',
    'option': [
      'A、定期清理计算机垃圾文件',
      'B、频繁更换计算机硬件',
      'C、严格的数据访问控制和加密',
      'D、增加网络带宽'
    ],
    'value': 'C'
  },
  {
    'title': '28、下列哪项是网络安全中“保密性”原则的具体体现（  ）',
    'option': [
      'A、确保数据在传输和存储过程中不被篡改',
      'B、确保数据只能被授权者访问和使用',
      'C、确保网络系统始终可用',
      'D、确保数据易于理解和使用'
    ],
    'value': 'B'
  },
  {
    'title': '29、下列关于网络安全的描述，哪项是错误的（  ）',
    'option': [
      'A、网络安全是一个多层次的防护体系',
      'B、网络安全仅仅依赖技术手段就能完全保障',
      'C、网络安全需要技术和管理的结合',
      'D、网络安全需要不断更新和完善防护策略'
    ],
    'value': 'B'
  },
  {
    'title': '30、在网络安全领域，APT通常指的是（  ）',
    'option': [
      'A、高级持续性威胁',
      'B、应用传输协议',
      'C、异步传输模式',
      'D、应用程序接口'
    ],
    'value': 'A'
  },
  {
    'title': '31、以下哪项不是网络安全的基本原则之一（  ）',
    'option': [
      'A、完整性',
      'B、可用性',
      'C、匿名性',
      'D、保密性'
    ],
    'value': 'C'
  },
  {
    'title': '32、下列哪项是网络安全领域中的“蜜罐”技术的主要用途（  ）',
    'option': [
      'A、吸引并收集攻击者的信息',
      'B、加速网络访问速度',
      'C、提供网络服务',
      'D、防止病毒传播'
    ],
    'value': 'A'
  },
  {
    'title': '33、关于网络安全中的"两步验证"（Two-factor Authentication），以下描述正确的是（  ）',
    'option': [
      'A、只需要用户名和密码就能登录系统',
      'B、只需要手机验证码就能登录系统',
      'C、需要用户提供两种或两种以上的验证信息才能登录系统',
      'D、是一种保护用户隐私的技术'
    ],
    'value': 'C'
  },
  {
    'title': '34、在网络安全中，什么是"蜜罐"（Honeypot）（  ）',
    'option': [
      'A、一个真实的、用于收集网络攻击数据的系统',
      'B、一个模拟的系统，用于吸引并收集网络攻击信息',
      'C、一种网络防火墙技术',
      'D、一种用于检测网络流量的工具'
    ],
    'value': 'B'
  },
  {
    'title': '35、关于跨站脚本攻击（XSS），以下说法正确的是（  ）',
    'option': [
      'A、XSS攻击只能发生在具有用户输入功能的网页上',
      'B、XSS攻击是攻击者向网站发送恶意代码，使网站被篡改',
      'C、XSS攻击允许攻击者在受害者的浏览器上执行恶意脚本',
      'D、XSS攻击只能通过恶意链接进行传播'
    ],
    'value': 'C'
  },
  {
    'title': '36、在网络安全中，什么是"钓鱼"（Phishing）（  ）',
    'option': [
      'A、一种网络攻击方式，攻击者伪装成可信实体，诱骗用户点击恶意链接或下载恶意软件',
      'B、一种物理攻击方式，通过诱饵捕捉目标',
      'C、一种加密技术，用于保护敏感数据的传输',
      'D、一种用于测试网络安全性的技术'
    ],
    'value': 'A'
  },
  {
    'title': '37、以下哪项措施不属于防止SQL注入攻击的常用方法（  ）',
    'option': [
      'A、使用参数化查询或预编译语句',
      'B、对用户输入进行严格的验证和过滤',
      'C、禁用Web服务器的错误报告功能',
      'D、使用明文传输敏感数据'
    ],
    'value': 'D'
  },
  {
    'title': '38、哪种加密技术被广泛用于保护无线网络通信的安全（  ）',
    'option': [
      'A、AES (高级加密标准)',
      'B、RSA (非对称加密算法)',
      'C、SHA-256 (哈希算法)',
      'D、WEP (有线等效加密'
    ],
    'value': 'A'
  },
  {
    'title': '39、在网络安全中，什么是DDoS攻击（分布式拒绝服务攻击）（  ）',
    'option': [
      'A、攻击者通过大量请求拥塞目标服务器，使其无法处理正常请求',
      'B、攻击者通过伪造身份骗取用户敏感信息',
      'C、攻击者通过恶意软件控制受害者的计算机',
      'D、攻击者通过发送病毒或蠕虫破坏目标网络'
    ],
    'value': 'A'
  },
  {
    'title': '40、以下哪项不是网络安全策略的重要组成部分（  ）',
    'option': [
      'A、定期备份重要数据',
      'B、使用强密码策略',
      'C、允许所有用户远程访问公司网络',
      'D、定期更新操作系统和软件补丁'
    ],
    'value': 'C'
  },
  {
    'title': '41、哪种类型的攻击通常涉及假冒合法用户或系统以获取敏感信息（  ）',
    'option': [
      'A、拒绝服务攻击（DoS）',
      'B、跨站脚本攻击（XSS）',
      'C、社会工程学攻击',
      'D、缓冲区溢出攻击'
    ],
    'value': 'C'
  },
  {
    'title': '42、关于网络钓鱼（Phishing）邮件，以下哪项描述是正确的（  ）',
    'option': [
      'A、邮件中通常包含真实的银行链接',
      'B、邮件通常来自一个可信的电子邮件地址',
      'C、邮件通常包含虚假的紧急请求或优惠信息',
      'D、邮件中的链接通常会显示真实的目标URL'
    ],
    'value': 'C'
  },
  {
    'title': '43、在网络安全中，什么是“中间人攻击”（Man-in-the-Middle Attack）（  ）',
    'option': [
      'A、攻击者拦截并修改两个通信方之间的通信内容',
      'B、攻击者伪装成网络管理员以获取访问权限',
      'C、攻击者通过发送大量数据包使网络瘫痪',
      'D、攻击者使用物理手段破坏网络连接'
    ],
    'value': 'A'
  },
  {
    'title': '44、哪种网络安全措施可以确保只有授权的设备才能访问无线网络（  ）',
    'option': [
      'A、WPA2加密',
      'B、MAC地址过滤',
      'C、防火墙',
      'D、入侵检测系统（IDS）'
    ],
    'value': 'B'
  },
  {
    'title': '45、在局域网标准中,100BASE-T规定从收发器到集线器的距离不超过（  ）',
    'option': [
      'A、100',
      'B、185',
      'C、300',
      'D、1000'
    ],
    'value': 'A'
  },
  {
    'title': '46、下列协议中与电子邮件安全无关的是（  ）',
    'option': [
      'A、SSL',
      'B、HTTPS',
      'C、MIME',
      'D、PGP'
    ],
    'value': 'C'
  },
  {
    'title': '47、下列哪个不是Internet的常见传输层协议（  ）',
    'option': [
      'A、TCP',
      'B、UDP',
      'C、IPX',
      'D、ICMP'
    ],
    'value': 'C'
  },
  {
    'title': '48、想对IP地址为100.100.100.100的计算机发送10个数据包的ping命令是（  ）',
    'option': [
      'A、ping 100.100.100.100 10',
      'B、ping 100.100.100.100 –l 10',
      'C、ping 100.100.100.100 –t 10',
      'D、ping 100.100.100.100 –n 10'
    ],
    'value': 'D'
  },
  {
    'title': '49、下列哪个不属于TCP/IP协议族（  ）',
    'option': [
      'A、TCP',
      'B、IPX',
      'C、UDP',
      'D、ICMP'
    ],
    'value': 'B'
  },
  {
    'title': '50、HTTP协议默认使用的端口号是（  ）',
    'option': [
      'A、80',
      'B、443',
      'C、21',
      'D、22'
    ],
    'value': 'A'
  },
  {
    'title': '51、DNS（Domain Name System）的作用是（  ）',
    'option': [
      'A、控制网络流量',
      'B、加密网络数据',
      'C、将域名解析为IP地址',
      'D、防火墙设置'
    ],
    'value': 'C'
  },
  {
    'title': '52、下列哪个是用于在Internet上唯一标识一个设备的地址（  ）',
    'option': [
      'A、MAC地址',
      'B、IP地址',
      'C、URL',
      'D、端口号'
    ],
    'value': 'B'
  },
  {
    'title': '53、OSI（Open Systems Interconnection）模型将网络通信分为多少个层次（  ）',
    'option': [
      'A、5',
      'B、6',
      'C、7',
      'D、8'
    ],
    'value': 'C'
  },
  {
    'title': '54、下列哪个是用于测量网络连接速度的指标（  ）',
    'option': [
      'A、IP地址',
      'B、MAC地址',
      'C、带宽',
      'D、端口号'
    ],
    'value': 'C'
  },
  {
    'title': '55、在网络中，使用哪种协议实现文件传输（  ）',
    'option': [
      'A、FTP',
      'B、SMTP',
      'C、POP3',
      'D、HTTP'
    ],
    'value': 'A'
  },
  {
    'title': '56、下列哪个不是用于加密网络通信的协议（  ）',
    'option': [
      'A、SSL',
      'B、TLS',
      'C、HTTP',
      'D、HTTPS'
    ],
    'value': 'C'
  },
  {
    'title': '57、在网络安全中，哪个术语指的是未经授权访问、使用、修改或破坏信息系统（  ）',
    'option': [
      'A、黑客',
      'B、恶意软件',
      'C、入侵',
      'D、漏洞'
    ],
    'value': 'C'
  },
  {
    'title': '58、关于网络安全，以下哪个说法是正确的（  ）',
    'option': [
      'A、网络安全只是技术问题，与人的行为无关',
      'B、网络安全只需要保护公司的数据',
      'C、网络安全是保护信息系统免受未经授权的访问、使用、修改或破坏的实践',
      'D、网络安全措施是固定的，不需要更新'
    ],
    'value': 'C'
  },
  {
    'title': '59、哪种攻击类型试图通过猜测或破解密码来非法访问系统（  ）',
    'option': [
      'A、暴力破解',
      'B、拒绝服务攻击',
      'C、网络钓鱼',
      'D、SQL注入'
    ],
    'value': 'A'
  },
  {
    'title': '60、哪种技术可以在网络中检测和阻止未经授权的访问或恶意流量（  ）',
    'option': [
      'A、防火墙',
      'B、路由器',
      'C、交换机',
      'D、负载均衡器'
    ],
    'value': 'A'
  },
  {
    'title': '61、哪种加密方法使用了一对密钥，其中一个用于加密数据，另一个用于解密数据（  ）',
    'option': [
      'A、对称加密',
      'B、非对称加密',
      'C、哈希加密',
      'D、双重加密'
    ],
    'value': 'B'
  },
  {
    'title': '62、以下哪个协议提供了对电子邮件的加密和数字签名（  ）',
    'option': [
      'A、SMTP',
      'B、POP3',
      'C、IMAP',
      'D、S/MIME'
    ],
    'value': 'D'
  },
  {
    'title': '63、哪种技术可以帮助组织识别和记录网络中的异常活动（  ）',
    'option': [
      'A、入侵检测系统（IDS）',
      'B、入侵防御系统（IPS）',
      'C、安全信息和事件管理（SIEM）',
      'D、虚拟专用网络（VPN）'
    ],
    'value': 'C'
  },
  {
    'title': '64、哪种方法可以帮助检测网络中的潜在安全漏洞（  ）',
    'option': [
      'A、漏洞扫描',
      'B、入侵检测系统',
      'C、防火墙',
      'D、数据备份'
    ],
    'value': 'A'
  },
  {
    'title': '65、有关信息安全事件的描述不正确的是（  ）',
    'option': [
      'A、信息安全事件的处理应该分类、分级',
      'B、信息安全事件的数量可以反映企业的信息安全管控水平',
      'C、某个时期内企业的信息安全事件的数量为零，这意味着企业面临的信息安全风险很小',
      'D、信息安全事件处理流程中的一个重要环节是对事件发生的根源的追溯，以吸取教训、总结经验，防止类似事情再次发生'
    ],
    'value': 'C'
  },
  {
    'title': '66、下列哪一种防病毒软件的实施策略在内部公司网络中是最有效的（  ）',
    'option': [
      'A、服务器防毒软件',
      'B、病毒墙',
      'C、工作站防病毒软件',
      'D、病毒库及时更新'
    ],
    'value': 'D'
  },
  {
    'title': '67、基本的计算机安全需求不包括下列哪一条（  ）',
    'option': [
      'A、安全策略和标识',
      'B、绝对的保证和持续的保护',
      'C、身份鉴别和落实责任',
      'D、合理的保证和连续的保护'
    ],
    'value': 'B'
  },
  {
    'title': '68、以下哪一个是数据保护的最重要的目标（  ）',
    'option': [
      'A、确定需要访问信息的人员',
      'B、确保信息的完整性',
      'C、拒绝或授权对系统的访问',
      'D、监控逻辑访问'
    ],
    'value': 'A'
  },
  {
    'title': '69、在应对水坑攻击时，以下哪种策略是有效的（  ）',
    'option': [
      'A、定期检查网站内容',
      'B、禁止员工上网',
      'C、使用防火墙隔离内部网络',
      'D、加密所有存储数据'
    ],
    'value': 'A'
  },
  {
    'title': '70、为了防止会话劫持攻击，以下哪种措施是必要的（  ）',
    'option': [
      'A、禁用HTTP协议',
      'B、使用HTTPS协议',
      'C、限制会话时间',
      'D、禁止用户登录'
    ],
    'value': 'B'
  },
  {
    'title': '71、在防御ARP欺骗攻击时，以下哪种方法最为有效（  ）',
    'option': [
      'A、部署ARP防火墙',
      'B、禁用ARP协议',
      'C、限制网络广播',
      'D、加密所有网络通信'
    ],
    'value': 'A'
  },
  {
    'title': '72、为了防止命令注入攻击，以下哪种措施是关键的（  ）',
    'option': [
      'A、禁用命令行界面',
      'B、对用户输入进行严格的验证和过滤',
      'C、限制用户访问权限',
      'D、使用最新的操作系统'
    ],
    'value': 'B'
  },
  {
    'title': '73、对于缓冲区溢出攻击，以下哪种防御策略最为有效（  ）',
    'option': [
      'A、禁用所有外部程序',
      'B、使用安全的编程语言和库',
      'C、限制程序运行时间',
      'D、加密所有程序文件'
    ],
    'value': 'B'
  },
  {
    'title': '74、在保护企业网络免受内部威胁时，以下哪项是最佳实践（  ）',
    'option': [
      'A、禁止员工使用个人设备',
      'B、部署网络监控软件',
      'C、信任所有内部用户',
      'D、加密所有内部通信'
    ],
    'value': 'B'
  },
  {
    'title': '75、为了防止DNS劫持攻击，以下哪种措施是必要的（  ）',
    'option': [
      'A、禁用DNS服务',
      'B、使用安全的DNS服务器',
      'C、限制DNS查询频率',
      'D、加密所有DNS通信'
    ],
    'value': 'B'
  },
  {
    'title': '76、在应对网络钓鱼攻击时，以下哪种策略是有效的（  ）',
    'option': [
      'A、禁止所有电子邮件',
      'B、部署反钓鱼软件',
      'C、禁止员工使用社交媒体',
      'D、加密所有电子邮件附件'
    ],
    'value': 'B'
  },
  {
    'title': '77、为了防止网络钓鱼攻击，企业最应该采取哪种措施（  ）',
    'option': [
      'A、加强员工的安全意识培训',
      'B、禁止所有外部邮件的接收',
      'C、部署防火墙以过滤恶意邮件',
      'D、加密所有网络通信'
    ],
    'value': 'A'
  },
  {
    'title': '78、针对暴力破解攻击，以下哪种策略最为有效（  ）',
    'option': [
      'A、禁用所有用户账户',
      'B、使用强密码策略',
      'C、限制登录尝试次数',
      'D、加密所有用户数据'
    ],
    'value': 'C'
  },
  {
    'title': '79、在保护企业数据免受泄露风险时，以下哪项是最佳实践（  ）',
    'option': [
      'A、禁止员工访问数据',
      'B、定期备份数据',
      'C、加密存储敏感数据',
      'D、限制网络带宽以防止数据泄露'
    ],
    'value': 'C'
  },
  {
    'title': '80、为了防止中间人攻击，企业应当如何配置其网络通信（  ）',
    'option': [
      'A、禁用所有外部通信',
      'B、使用安全的通信协议（如TLS）',
      'C、限制内部网络通信',
      'D、加密所有内部文件'
    ],
    'value': 'B'
  },
  {
    'title': '81、对信息安全的理解，正确的是（  ）',
    'option': [
      'A、信息资产的保密性、完整性和可用性不受损害的能力，是通过信息安全保障措施实现的',
      'B、通过信息安全保障措施，确保信息不被丢失',
      'C、通过信息安全保证措施，确保固定资产及相关财务信息的完整性',
      'D、通过技术保障措施，确保信息系统及财务数据的完整性、机密性及可用性'
    ],
    'value': 'A'
  },
  {
    'title': '82、在信息安全策略体系中，下面哪一项属于计算机或信息安全的强制性规则（  ）',
    'option': [
      'A、标准（Standard）',
      'B、安全策略（Security policy）',
      'C、方针（Guideline）',
      'D、流程（Procedure）'
    ],
    'value': 'A'
  },
  {
    'title': '83、下面哪一项最好地描述了风险分析的目的（  ）',
    'option': [
      'A、识别用于保护资产的责任义务和规章制度',
      'B、识别资产以及保护资产所使用的技术控制措施',
      'C、识别资产、脆弱性并计算潜在的风险',
      'D、识别同责任义务有直接关系的威胁'
    ],
    'value': 'C'
  },
  {
    'title': '84、以下哪些不属于脆弱性范畴（  ）',
    'option': [
      'A、黑客攻击',
      'B、操作系统漏洞',
      'C、应用程序BUG',
      'D、人员的不良操作习惯'
    ],
    'value': 'A'
  },
  {
    'title': '85、以下哪一项是已经被确认了的具有一定合理性的风险（  ）',
    'option': [
      'A、总风险',
      'B、最小化风险',
      'C、可接受风险',
      'D、残余风险'
    ],
    'value': 'C'
  },
  {
    'title': '86、下面哪一个不是系统设计阶段风险管理的工作内容（  ）',
    'option': [
      'A、安全技术选择',
      'B、软件设计风险控制',
      'C、安全产品选择',
      'D、安全需求分析'
    ],
    'value': 'D'
  },
  {
    'title': '87、以下哪个术语描述了将信息从可读状态转换为不可读状态的过程（  ）',
    'option': [
      'A、加密',
      'B、解密',
      'C、解码',
      'D、编码'
    ],
    'value': 'A'
  },
  {
    'title': '88、RSA加密算法中，密钥的长度越长，通常会导致什么结果（  ）',
    'option': [
      'A、加密速度变快',
      'B、解密速度变快',
      'C、加密强度变强',
      'D、加密强度变弱'
    ],
    'value': 'C'
  },
  {
    'title': '89、在加密过程中，密文是什么（  ）',
    'option': [
      'A、未经过加密的原始数据',
      'B、经过加密后的数据',
      'C、加密算法的名称',
      'D、加密的过程'
    ],
    'value': 'B'
  },
  {
    'title': '90、在密码学中，用于验证数据完整性和真实性的技术是什么（  ）',
    'option': [
      'A、加密',
      'B、解密',
      'C、数字签名',
      'D、密钥交换'
    ],
    'value': 'C'
  },
  {
    'title': '91、单向哈希函数的特点是（  ）',
    'option': [
      'A、不可逆',
      'B、可逆',
      'C、加密速度快',
      'D、只能用于对称加密'
    ],
    'value': 'A'
  },
  {
    'title': '92、对称加密算法的特点是（  ）',
    'option': [
      'A、加密和解密使用相同的密钥',
      'B、加密和解密使用不同的密钥',
      'C、加密速度慢',
      'D、生成密钥时使用公钥'
    ],
    'value': 'A'
  },
  {
    'title': '93、在加密过程中，如果密钥过短，可能会导致的问题是（  ）',
    'option': [
      'A、加密速度变慢',
      'B、密文变得更安全',
      'C、密文变得更易破解',
      'D、解密速度变快'
    ],
    'value': 'C'
  },
  {
    'title': '94、关于对称加密体制,下列说法不正确的是（  ）',
    'option': [
      'A、密钥分配和管理困难',
      'B、由加密过程很容易推导出解密过程',
      'C、不需要建立受保护的通道来传递密钥',
      'D、加密速度快'
    ],
    'value': 'C'
  },
  {
    'title': '95、“进不来”“拿不走”“看不懂”“改不了”“走不脱”是网络信息安全建设的目的。其中,“看不懂”是指下面哪种安全服务（  ）',
    'option': [
      'A、数据加密',
      'B、身份认证',
      'C、数据完整性',
      'D、访问控制'
    ],
    'value': 'A'
  },
  {
    'title': '96、密码学在信息安全中的应用是多样的,以下（  ）',
    'option': [
      'A、生成各种网络协议',
      'B、消息认证,确保信息完整性',
      'C、加密技术,保护传输信息',
      'D、进行身份认证'
    ],
    'value': 'A'
  },
  {
    'title': '97、在密码学中，需要被交换的原消息被称为什么（  ）',
    'option': [
      'A、密文',
      'B、算法',
      'C、密码',
      'D、明文'
    ],
    'value': 'D'
  },
  {
    'title': '98、如果消息接受方要确定发送方身份，则要使用（  ）',
    'option': [
      'A、保密性',
      'B、鉴别',
      'C、完整性',
      'D、访问控制'
    ],
    'value': 'B'
  },
  {
    'title': '99、对于现代密码破解，（  ）',
    'option': [
      'A、攻破算法',
      'B、监听截获',
      'C、信息猜测',
      'D、暴力破解'
    ],
    'value': 'D'
  },
  {
    'title': '100、如果要保证（  ）',
    'option': [
      'A、保密性',
      'B、鉴别',
      'C、完整性',
      'D、访问控制'
    ],
    'value': 'C'
  },
  {
    'title': '101、在移动应用程序中，常用的用于验证用户身份的机制是什么（  ）',
    'option': [
      'A、双因素认证',
      'B、单向散列函数',
      'C、对称加密',
      'D、MD5'
    ],
    'value': 'A'
  },
  {
    'title': '102、当你在网上注册新账户时，常常需要设置一个密码。为了确保密码的安全性，你应该（  ）',
    'option': [
      'A、使用相同的密码在多个网站上注册',
      'B、使用包含字母、数字和特殊字符的长密码',
      'C、将密码写在纸上以防忘记',
      'D、将密码设置为你的生日或常用的单词'
    ],
    'value': 'B'
  },
  {
    'title': '103、当你在网上进行登录时，系统经常会要求你输入一个验证码，这是用来做什么的（  ）',
    'option': [
      'A、防止机器人攻击',
      'B、加密登录信息',
      'C、验证服务器身份',
      'D、加速登录过程'
    ],
    'value': 'A'
  },
  {
    'title': '104、当在网站上重置密码时，系统通常会发送一封包含重置链接的电子邮件。为什么会这样做（  ）',
    'option': [
      'A、防止恶意用户尝试重置密码',
      'B、通过加密链接确保安全',
      'C、简化用户体验',
      'D、提高系统性能'
    ],
    'value': 'B'
  },
  {
    'title': '105、关于RAID1阵列，下列说法正确的是（  ）',
    'option': [
      'A、必须偶数块硬盘组成',
      'B、必须两块硬盘组成',
      'C、可以提升读取性能',
      'D、可以提升写入性能'
    ],
    'value': 'C'
  },
  {
    'title': '106、等级保护2.0中的第四级中，安全区域边界要求：“应在网络边界通过通信协议转换或通信协议隔离等方式进行数据交换。”在通常实践中，用以下哪个设备来实现此功能（  ）',
    'option': [
      'A、NGFW',
      'B、IDS',
      'C、IPS',
      'D、网闸'
    ],
    'value': 'D'
  },
  {
    'title': '107、ISMS是基于组织的（  ）',
    'option': [
      'A、财务部门',
      'B、资产安全',
      'C、信息部门',
      'D、整体业务'
    ],
    'value': 'D'
  },
  {
    'title': '108、数据安全责任，按照（  ）',
    'option': [
      'A、谁所有谁负责、谁持有谁负责、谁管理谁负责、谁使用谁负责、谁采集谁负责',
      'B、谁所有谁负责、谁持有谁负责、谁管理谁负责、谁使用谁负责',
      'C、谁所有谁负责、谁持有谁负责、谁管理谁负责',
      'D、谁所有谁负责、谁持有谁负责'
    ],
    'value': 'A'
  },
  {
    'title': '109、以下哪项不属于政务数据共享的类型（  ）',
    'option': [
      'A、无条件共享',
      'B、有条件共享',
      'C、不予共享',
      'D、部分共享'
    ],
    'value': 'D'
  },
  {
    'title': '110、以下哪项政务数据可以开放（  ）',
    'option': [
      'A、涉及国家秘密',
      'B、商业秘密',
      'C、个人隐私',
      'D、领导任命前的公示'
    ],
    'value': 'D'
  },
  {
    'title': '111、以下对信息安全描述不正确的是（  ）',
    'option': [
      'A、信息安全的基本要素包括保密性、完整性和可用性',
      'B、信息安全就是保障企业信息系统能够连续、可靠、正常地运行',
      'C、信息安全就是不出安全事故/事件',
      'D、信息安全风险是科技风险的一部分'
    ],
    'value': 'C'
  },
  {
    'title': '112、在软件程序测试的哪个阶段一个组织应该进行体系结构设计测试（  ）',
    'option': [
      'A、可接受性测试',
      'B、系统测试',
      'C、集成测试',
      'D、单元测试'
    ],
    'value': 'C'
  },
  {
    'title': '113、以下快捷设置，安全强度最高的是（  ）',
    'option': [
      'A、Windows键+L',
      'B、Ctrl键+L',
      'C、Alt键+L',
      'D、Shift键+L'
    ],
    'value': 'A'
  },
  {
    'title': '114、国家鼓励开发网络数据安全保护和利用技术，促进（  ）',
    'option': [
      'A、国家政务数据开放',
      'B、国家数据资源开放',
      'C、公共数据资源开放',
      'D、敏感数据合理开放'
    ],
    'value': 'C'
  },
  {
    'title': '115、网络运营者应当加强对其用户发布的信息的管理，发现法律、行政法规禁止发布或者传输的信息的，应当立即停止传输该信息，采取（  ）',
    'option': [
      'A、境外存储公安部门',
      'B、第三方中立机构存储监管机构',
      'C、交由国家存储党中央',
      'D、境内存储网信部门'
    ],
    'value': 'D'
  },
  {
    'title': '116、数据生命周期是指对数据进行（  ）',
    'option': [
      'A、采集和传输',
      'B、存储和使用',
      'C、删除和销毁',
      'D、以上都对'
    ],
    'value': 'D'
  },
  {
    'title': '117、关于数据安全管理，以下哪项说法不合理（  ）',
    'option': [
      'A、数据安全应当全员参与',
      'B、人是薄弱的环节',
      'C、部署数据安全的产品就可以解决数据安全问题',
      'D、有必要增强数据安全意识培训'
    ],
    'value': 'C'
  },
  {
    'title': '118、在网络安全中，哪种技术用于在开放网络上安全地传输数据？（  ）',
    'option': [
      'A、SSH',
      'B、SMTP',
      'C、FTP',
      'D、HTTP'
    ],
    'value': 'A'
  },
  {
    'title': '119、对于数据安全防护，访问权限管理是一项良好的安全实践，以下访问权限控制措施中合适的是（  ）',
    'option': [
      'A、严格管理数据库权限',
      'B、严格管理运维账号权限',
      'C、对服务器主机登录权限做管控:',
      'D、以上都对'
    ],
    'value': 'D'
  },
  {
    'title': '120、对于数据安全防护，访问控制措施是一个基础的防护手段，以下哪项可以被认为是访问控制措施（  ）',
    'option': [
      'A、基于五元组的访问控制',
      'B、基于时间的访问控制',
      'C、基于角色的访问控制',
      'D、以上都对'
    ],
    'value': 'D'
  },
  {
    'title': '121、关于数据库恢复技术，下列说法不正确的是（  ）',
    'option': [
      'A、数据库恢复技术的实现主要依靠各种数据的冗余和恢复机制技术来解决，当数据库中数据被破坏时，可以利用冗余数据来进行修复',
      'B、数据库管理员定期地将整个数据库或部分数据库文件备份到磁带或另一个磁盘上保存起来，是数据库恢复中采用的基本技术',
      'C、日志文件在数据库恢复中起着非常重要的作用，可以用来进行事务故障恢复和系统故障恢复，并协助后备副本进行介质故障恢复',
      'D、计算机系统发生故障导致数据未存储到固定存储器上，利用日志文件中故障发生前数据的循环，将数据库恢复到故障发生前的完整状态，这一对事务的操作称为提交'
    ],
    'value': 'D'
  },
  {
    'title': '122、应用安全，一般是指保障应用程序使用过程和结果的安全。以下内容中不属于应用安全防护考虑的是（  ）',
    'option': [
      'A、身份鉴别，应用系统应对登陆的用户进行身份鉴别，只有通过验证的用户才能访问应用系统资源',
      'B、安全标记，在应用系统层面对主体和客体进行标记，主体不能随意更改权限，增加访问',
      'C、剩余信息保护，应用系统应加强硬盘、内存或缓冲区中剩余信息的保护，防止存储在硬盘、内存或缓冲区的信息被非授权的访问',
      'D、机房与设施安全，保证应用系统处于有一个安全的环境条件，包括机房环境、机房安全等级、机房的建造和机房的装修等'
    ],
    'value': 'D'
  },
  {
    'title': '123、下面对“零日（Zero-Day）漏洞”的理解中，正确的是（  ）',
    'option': [
      'A、指一个特定的漏洞，该漏洞每年1月1日零点发作，可以被攻击者用来远程攻击，获取主机权限',
      'B、指通过漏洞扫描系统发现但是还没有被通告给监管机构的漏洞',
      'C、指一类漏洞，即特别好被利用，一旦成功利用该类漏洞，可以在1天内完成攻击，且成功达到攻击目标',
      'D、指一类漏洞，即刚被发现后立即被恶意利用的安全漏洞，一般来说，已经被小部分人发现，但还未公开、也不存在安全补丁的漏洞都是零日漏洞'
    ],
    'value': 'D'
  },
  {
    'title': '124、在对某面向互联网提供服务的某应用服务器的安全检测中发现，服务器上开放了以下几个应用，除了一个应用外其他应用都存在明文传输信息的安全问题，作为一名检测人员，你需要告诉用户对应用进行安全整改以解决明文传输数据的问题，以下哪个应用已经解决了明文传输数据问题（  ）',
    'option': [
      'A、SSH',
      'B、HTTP',
      'C、FTP',
      'D、SMTP'
    ],
    'value': 'A'
  },
  {
    'title': '125、在对Linux 系统中dir目录及其子目录进行权限权限统一调整时所使用的命令是什么（  ）',
    'option': [
      'A、rm -fr -755 /dir',
      'B、ls -755 /dir',
      'C、chmod 755 /dir/*',
      'D、chmod -R 755 /dir'
    ],
    'value': 'D'
  },
  {
    'title': '126、以下关于Windows系统的账号存储管理机制的说法哪个是正确的（  ）',
    'option': [
      'A、存储在注册表中的账号数据是管理员组用户都可以访问，具有较高的安全性',
      'B、存储在注册表中的账号数据只有administrator账户才有权访问，具有较高的安全性',
      'C、存储在注册表中的账号数据任何用户都可以直接访问，灵活方便',
      'D、存储在注册表中的账号数据有只有System账户才能访问，具有较高的安全性'
    ],
    'value': 'D'
  },
  {
    'title': '127、以下对Windows系统的服务描述，正确的是（  ）',
    'option': [
      'A、Windows服务必须是一个独立的可执行程序',
      'B、Windows服务的运行不需要用户的交互登陆',
      'C、Windows服务都是随系统启动而启动，无需用户进行干预',
      'D、Windows服务都需要用户进行登陆后，以登录用户的权限进行启动'
    ],
    'value': 'B'
  },
  {
    'title': '128、以下发现属于Linux系统严重威胁的是什么（  ）',
    'option': [
      'A、发现不明的SUID可执行文件',
      'B、发现应用的配置文件被管理员变更',
      'C、发现有恶意程序在实时的攻击系统',
      'D、发现防护程序收集了很多黑客攻击的源地址'
    ],
    'value': 'A'
  },
  {
    'title': '129、哪种技术用于在数据传输过程中确保数据的完整性和真实性？（  ）',
    'option': [
      'A、哈希函数',
      'B、对称加密',
      'C、非对称加密',
      'D、数字签名'
    ],
    'value': 'D'
  },
  {
    'title': '130、哪种网络攻击方式通过伪装成合法用户或系统来骗取敏感信息（  ）',
    'option': [
      'A、钓鱼攻击',
      'B、中间人攻击',
      'C、水坑攻击',
      'D、暴力破解'
    ],
    'value': 'A'
  },
  {
    'title': '131、2022年银保监会消保局将加大监管力度，重点开展开展银行业保险业个人信息保护专项整治，推动银行业保险业落实下列哪一部法律，提升个人信息使用的规范性，保护消费者信息安全权（  ）',
    'option': [
      'A、《个人信息保护法》',
      'B、《民法典》',
      'C、《网络安全法》',
      'D、《数据安全法》'
    ],
    'value': 'A'
  },
  {
    'title': '132、恢复策略的选择最可能取决于（  ）',
    'option': [
      'A、基础设施和系统的恢复成本',
      'B、恢复站点的可用性',
      'C、关键性业务流程',
      'D、事件响应流程'
    ],
    'value': 'C'
  },
  {
    'title': '133、《信息安全技术 移动互联网应用（App）收集个人信息基本规范》要求，金融借贷类App可以获取的最小权限范围为（  ）',
    'option': [
      'A、通讯录',
      'B、地理位置',
      'C、存储权限',
      'D、相机'
    ],
    'value': 'C'
  },
  {
    'title': '134、根据《个人信息保护法》的规定，哪些主体会受到侵犯个人信息的惩处（  ）',
    'option': [
      'A、仅对企业',
      'B、仅对直接负责的主管人员',
      'C、仅对直接负责的主管人员和其他直接责任人员',
      'D、对企业及其直接负责的主管人员和其他直接责任人员'
    ],
    'value': 'D'
  },
  {
    'title': '135、监视恶意代码主体程序是否正常的技术是（  ）',
    'option': [
      'A、进程守护',
      'B、备份文件',
      'C、超级权限',
      'D、HOOK技术'
    ],
    'value': 'A'
  },
  {
    'title': '136、为降低本国数据传输至境外造成的安全风险，我国针对性的推出了哪项政策法规（  ）',
    'option': [
      'A、《关键信息基础设施安全保护条例》',
      'B、《网络安全产品漏洞管理规定》',
      'C、《数据出境安全评估办法》',
      'D、《信息安全等级保护管理办法》'
    ],
    'value': 'B'
  },
  {
    'title': '137、区块链信息服务提供者开发上线（  ）',
    'option': [
      'A、新产品',
      'B、新应用',
      'C、新功能',
      'D、以上都需要'
    ],
    'value': 'D'
  },
  {
    'title': '138、计算机信息系统实行安全等级保护。安全等级的划分标准和安全等级保护的具体办法，由（  ）',
    'option': [
      'A、国家安全部',
      'B、国家保密局',
      'C、公安部',
      'D、国家网信部门'
    ],
    'value': 'C'
  },
  {
    'title': '139、对计算机信息系统中发生的案件，有关使用单位应当在（  ）',
    'option': [
      'A、12小时',
      'B、24小时',
      'C、48小时',
      'D、72小时'
    ],
    'value': 'B'
  },
  {
    'title': '140、运输、携带、邮寄计算机信息媒体进出境的，应当如实向（  ）',
    'option': [
      'A、省级以上人民政府公安机关',
      'B、国家安全部',
      'C、国家保密局',
      'D、海关'
    ],
    'value': 'D'
  },
  {
    'title': '141、在下载软件及操作系统补丁时，我们不应该采取哪项措施（  ）',
    'option': [
      'A、下载正版软件并定期更新',
      'B、及时跟随软件供应商发布的补丁',
      'C、定期使用防病毒软件并定期更新病毒库',
      'D、操作系统一定要用正版，其它工具软件大可不必'
    ],
    'value': 'D'
  },
  {
    'title': '142、等保2.0有安全扩展要求不包括哪个方面（  ）',
    'option': [
      'A、个人终端安全扩展要求',
      'B、移动互联安全扩展要求',
      'C、物联网安全扩展要求',
      'D、工业控制系统安全扩展要求'
    ],
    'value': 'A'
  },
  {
    'title': '143、从风险分析的观点来看，计算机系统的最主要弱点是（  ）',
    'option': [
      'A、内部计算机处理',
      'B、系统输入输出',
      'C、通讯和网络',
      'D、外部计算机处理'
    ],
    'value': 'B'
  },
  {
    'title': '144、建设、运营网络或者通过网络提供服务，应当依照法律、行政法规的规定和国家标准的强制性要求，采取技术措施和其他必要措施，保障网络安全、稳定运行，有效应对网络安全事件，防范网络违法犯罪活动，不包括维护网络数据的（  ）',
    'option': [
      'A、经济性',
      'B、可用性',
      'C、保密性',
      'D、完整性'
    ],
    'value': 'A'
  },
  {
    'title': '145、在网络安全中，什么是“双因素认证”（  ）',
    'option': [
      'A、使用两个不同的密码来登录系统',
      'B、同时使用两种不同的防病毒软件',
      'C、要求用户提供两种不同形式的身份验证信息',
      'D、仅使用生物识别技术进行用户认证'
    ],
    'value': 'C'
  },
  {
    'title': '146、以下哪类可以作为网络安全等级保护的定级对象（  ）',
    'option': [
      'A、社保查询系统',
      'B、烟草一体化平台系统',
      'C、航空公司电子客票系统',
      'D、以上都是'
    ],
    'value': 'D'
  },
  {
    'title': '147、关于信息系统安全等级保护第三级的系统运维管理，应建立系统安全管理制度，对（  ）',
    'option': [
      'A、系统安全策略',
      'B、安全配置',
      'C、日常操作流程',
      'D、以上都是'
    ],
    'value': 'A'
  },
  {
    'title': '148、以下哪类应用中可能存在大量个人信息，需要重点保护（  ）',
    'option': [
      'A、电子政务系统',
      'B、轨道交通系统',
      'C、烟草人力资源系统',
      'D、以上都是'
    ],
    'value': 'D'
  },
  {
    'title': '149、隐私保护和合规性的目的是什么（  ）',
    'option': [
      'A、防止物理安全威胁',
      'B、保护个人信息和敏感数据的安全和隐私',
      'C、提高网络防火墙的性能',
      'D、加速数据传输速度'
    ],
    'value': 'B'
  },
  {
    'title': '150、RAID5磁盘阵列由于其特性，在以下哪个场景适合使用（  ）',
    'option': [
      'A、数据镜像',
      'B、数据条带化加校验',
      'C、数据块级备份',
      'D、数据压缩存储'
    ],
    'value': 'B'
  },
  {
    'title': '151、下列哪项是描述“堆栈溢出”的最准确解释（  ）',
    'option': [
      'A、当程序试图从堆栈中读取超出其分配大小的数据时发生的情况',
      'B、当程序试图向堆内存写入超出其分配大小的数据时发生的情况',
      'C、当程序试图向堆栈写入超出其分配大小的数据时发生的情况',
      'D、当程序试图从堆内存中读取超出其分配大小的数据时发生的情况'
    ],
    'value': 'C'
  },
  {
    'title': '152、Windows系统下，哪项不是有效进行共享安全的防护措施（  ）',
    'option': [
      'A、使用netshare\\127.0.0.1\\c$/delete命令，删除系统中的c$等管理共享，并重启系统',
      'B、确保共享都有高强度的密码防护',
      'C、禁止通过“空会话”连接，以匿名方式列举用户、群组、系统配置和注册表键值',
      'D、安装软件防火墙阻止外面对共享目录的连接'
    ],
    'value': 'A'
  },
  {
    'title': '153、常用数据备份方式包括完全备份、增量备份、差异备份，其中在数据恢复速度方面三种备份方式由快到慢的顺序是（  ）',
    'option': [
      'A、完全备份、增量备份、差异备份',
      'B、完全备份、差异备份、增量备份',
      'C、增量备份、差异备份、完全备份',
      'D、差异备份、增量备份、完全备份'
    ],
    'value': 'B'
  },
  {
    'title': '154、系统灾难恢复测试中下列哪个问题最应该引起关注（  ）',
    'option': [
      'A、由于测试时间窗有限，所以仅仅测试最必要的系统，而其他系统可以安排在另外时间测试',
      'B、有些备份系数据有缺陷或不完整，导致测试失败',
      'C、在开启备份站点之前，关闭和保护原站点的时间比计划时间要长的多',
      'D、由于每年是相同的员工执行测试，所有参与者都熟悉恢复步骤，因而不使用灾难恢复计划文档'
    ],
    'value': 'B'
  },
  {
    'title': '155、SQLServer数据库支持两种身份验证模式：Windows身份验证模式和混合模式。SQLServer的混合模式认证是指：当网络用户尝试接到SQLServer数据库时（  ）',
    'option': [
      'A、Windows获取用户输入的账号和口令，并提交给SQLServe进行身份验证，并决定用户的数据库访权限',
      'B、SQLServer根据用户输入的账号和口令，并提交给Windows进行身份验证，并决定用户的数据库访权限',
      'C、SQLServer根据已在Windows网络中登录的用户的网络安全属性，对用户进行身份验证，并决定用户的数据库访问权限',
      'D、登录到本地Windows的用户均可无限制的访问SQLServe数据库'
    ],
    'value': 'C'
  },
  {
    'title': '156、关于4A下列说法正确的是（  ）',
    'option': [
      'A、即认证Authentication、授权Authorization、账号Account、审计Audit，',
      'B、结合统一用户账号管理、统一认证管理、统一授权管理和统一安全审计四要素后的解决方案',
      'C、涵盖单点登录（SSO）',
      'D、以上都对'
    ],
    'value': 'D'
  },
  {
    'title': '157、数据库安全涉及到数据资产的安全存储和安全访问,对数据库安全要求不包括（  ）',
    'option': [
      'A、向所有用户提供可靠的信息服务',
      'B、拒绝执行不正确的数据操作',
      'C、拒绝非法用户对数据库的访问',
      'D、能跟踪记录,以便为合规性检查、安全责任审查等提供证据和迹象等'
    ],
    'value': 'A'
  },
  {
    'title': '158、某企业IT主管对某信息系统拟定恢复点目标RPO-O，该指标代表（  ）',
    'option': [
      'A、RPO-O，相当于没有任何数据丢失，但需要进行业务恢复处理，覆盖原有信息',
      'B、RPO-O,相当于所有数据全部丢失，需要进行业务恢复处理。修复数据丢失',
      'C、RPO-O，相当于部分数据丢失，需要进行业务恢复处理，修复数据丢失',
      'D、RPO-O，相当于没有任何数据丢失，且不需要进行业务恢复处理'
    ],
    'value': 'D'
  },
  {
    'title': '159、以下关于政务数据描述错误的是（  ）',
    'option': [
      'A、指政府部门及法律法规授权具有行政职能的组织在履行职责过程中生成或获取的数据。',
      'B、政务数据类型包括文字、数字、图表、图像、音视频等。',
      'C、政务数据包括政务部门直接或者通过第三方依法采集、依法授权管理的和因履行职责需要依托政务信息系统形成的数据。',
      'D、政务数据中包含的个人信息可以直接参与数据交易，作为政府的新经济营收增长创新模式。'
    ],
    'value': 'D'
  },
  {
    'title': '160、依据IS0 27001，信息分类方案的目的是（  ）',
    'option': [
      'A、划分信息的数据型，如供销数据、生产数据、开发测试数据，以便于应用大数据技术对其分析。',
      'B、划分信息载体所属的职能以便于明确管理责任',
      'C、划分信息载体的不同介质以便于存储和处理，如纸张、光盘、磁盘。',
      'D、划分信息对于组织业务的关键性和敏感性分类，按此分类确定信息存储、处理、处置的原则'
    ],
    'value': 'D'
  },
  {
    'title': '161、数据的单位，从大到小依次排序正确的是（  ）',
    'option': [
      'A、TB>GB>MB>KB',
      'B、MB>GB>TB>PB',
      'C、PB>TB>MB>GB',
      'D、MB>TB>EB>GB'
    ],
    'value': 'A'
  },
  {
    'title': '162、以下关于数据库常用的安全策略理解不正确的是（  ）',
    'option': [
      'A、最小特权原则，是让用户可以合法的存取或修改数据库的前提下，分配最小的特权，使得这些信息恰好能够完成用户的工作',
      'B、最大共享策略，在保证数据库的完整性、保密性和可用性的前提下，最大程度地共享数据库中的信息',
      'C、粒度最小的策略，将数据库中数据项进行划分，粒度越小，安全级别越高，在实际中需要选择最小粒度',
      'D、按内容存取控制策略，不同权限的用户访问数据库的不同部分'
    ],
    'value': 'B'
  },
  {
    'title': '163、以下4种对BLP模型的描述中，正确的是（  ）',
    'option': [
      'A、BLP模型用于保证系统信息的机密性，规则是“向上读，向下写”',
      'B、BLP模型用于保证系统信息的机密性，规则是“向下读，向上写”',
      'C、BLP模型用于保证系统信息的完整性，规则是“向上读，向下写”',
      'D、BLP模型用于保证系统信息的完整性，规则是“向下读，向上写”'
    ],
    'value': 'B'
  },
  {
    'title': '164、实施灾难恢复计划之后，组织的灾难前和灾难后运营成本将（  ）',
    'option': [
      'A、降低',
      'B、不变',
      'C、提高',
      'D、提高或降低（取决于业务的性质）'
    ],
    'value': 'C'
  },
  {
    'title': '165、某用户通过账号，密码和验证码成功登陆某银行的个人网银系统，此过程属于以下哪一类（  ）',
    'option': [
      'A、个人网银和用户之间的双向鉴别',
      'B、由可信第三方完成的用户身份鉴别',
      'C、个人网银系统对用户身份的单向鉴别',
      'D、用户对个人网银系统合法性单向鉴别'
    ],
    'value': 'C'
  },
  {
    'title': '166、如果攻击者远程监控并查阅某服务器上的存储的敏感数据，此时希望通过清除日志避免被发现入侵痕迹，以下不属于清除痕迹的是（  ）',
    'option': [
      'A、窃取root权限修改或清除syslog',
      'B、入侵数据库审计，修改其针对数据库审计的策略',
      'C、保留系统运行临时文件',
      'D、修改登录日志为成功登录，增加审计难度'
    ],
    'value': 'C'
  },
  {
    'title': '167、甲对乙有读(R)权限，对丙有读写(RW)以及拥有(Own)权限，该访问控制是（  ）',
    'option': [
      'A、ACL表',
      'B、访问控制矩阵',
      'C、RACI表',
      'D、能力（CL）表'
    ],
    'value': 'D'
  },
  {
    'title': '168、《个人信息保护法》施行时间（  ）',
    'option': [
      'A、2019',
      'B、2020',
      'C、2021',
      'D、2022'
    ],
    'value': 'C'
  },
  {
    'title': '169、根据《网络安全法》的规定，网络安全事件应急预案应当按照事件发生后的（  ）',
    'option': [
      'A、危害程度',
      'B、发生时间',
      'C、事件大小',
      'D、关注人数'
    ],
    'value': 'A'
  },
  {
    'title': '170、以下做法，正确的是（  ）',
    'option': [
      'A、离职后将个人负责的项目的敏感文档一并带走',
      'B、将敏感信息在云盘备份',
      'C、会议室使用完毕后及时擦除白板',
      'D、在公共场所谈论敏感信息'
    ],
    'value': 'C'
  },
  {
    'title': '171、以下行为存在信息泄露隐患的是（  ）',
    'option': [
      'A、打印文件后删除打印机缓存内容',
      'B、使用碎纸机粉碎看过的重要资料',
      'C、为方便信息传送，拍摄屏幕',
      'D、数据在U盘加密处理'
    ],
    'value': 'C'
  },
  {
    'title': '172、重要数据的处理者应当按照规定对其数据处理活动定期开展风险评估，并向有关主管部门报送（  ）',
    'option': [
      'A、风险评估报告',
      'B、安全评估报告',
      'C、数据评估报告',
      'D、合规评估报告'
    ],
    'value': 'A'
  },
  {
    'title': '173、根据《数据安全法》规定，开展数据处理活动应当依照法律、法规的规定，建立健全（  ）',
    'option': [
      'A、全流程数据安全管理制度',
      'B、全流程数据合规管理制度',
      'C、一站式数据安全管理制度',
      'D、一站式数据治理保障制度'
    ],
    'value': 'A'
  },
  {
    'title': '174、以下哪种情形不适用《网络安全法》（  ）',
    'option': [
      'A、在中国境内管理网站',
      'B、在中国境内运营网站',
      'C、在境外使用境外网络',
      'D、在中国境外使用网站'
    ],
    'value': 'C'
  },
  {
    'title': '175、根据《网络安全法》的规定，网络产品、服务的提供者实施哪种行为会受到处罚（  ）',
    'option': [
      'A、提供符合相关国家标准的强制性要求的网络产品、服务；',
      'B、不在网络产品、服务中设置恶意程序；',
      'C、在规定或者当事人约定的期限内，终止提供安全维护；',
      'D、发现网络产品、服务存在安全缺陷、漏洞等风险时，立即采取补救措施，按照规定及时告知用户并向有关主管部门报告。'
    ],
    'value': 'C'
  },
  {
    'title': '176、根据《密码法》的规定，商用密码产品检测认证适用（  ）',
    'option': [
      'A、《中华人民共和国网络安全法》',
      'B、《中华人民共和国数码安全法》',
      'C、《中华人民共和国个人信息保护法》',
      'D、《中华人民共和国消费权益保护法》'
    ],
    'value': 'A'
  },
  {
    'title': '177、下列哪项是网络安全中“完整性”原则的核心内容（  ）',
    'option': [
      'A、确保数据在传输过程中不被篡改',
      'B、确保数据易于备份和恢复',
      'C、确保网络设备的稳定运行',
      'D、确保数据的加密级别足够高'
    ],
    'value': 'A'
  },
  {
    'title': '178、以下哪项措施不是用来提高网络安全性的（  ）',
    'option': [
      'A、使用强密码策略',
      'B、定期更新软件补丁',
      'C、在公共Wi-Fi上处理敏感信息',
      'D、限制不必要的网络端口'
    ],
    'value': 'C'
  },
  {
    'title': '179、网络安全的“可用性”原则指的是（  ）',
    'option': [
      'A、数据只能被授权者访问',
      'B、数据在传输中保持完整',
      'C、网络系统和服务在需要时能够正常运行',
      'D、数据被加密存储'
    ],
    'value': 'C'
  },
  {
    'title': '180、关于网络安全，以下哪项说法是正确的（  ）',
    'option': [
      'A、网络安全只是IT部门的责任',
      'B、网络安全措施可以一劳永逸，无需更新',
      'C、网络安全需要综合技术、管理和人员培训等多方面',
      'D、个人隐私在网络中不重要，无需特别保护'
    ],
    'value': 'C'
  },
  {
    'title': '181、下列哪项不是网络安全面临的主要挑战（  ）',
    'option': [
      'A、新型网络攻击手段的不断涌现',
      'B、用户安全意识薄弱',
      'C、网络速度的提升',
      'D、物联网设备的安全漏洞'
    ],
    'value': 'C'
  },
  {
    'title': '182、哪种攻击方式旨在窃取目标系统的敏感信息而不破坏系统（  ）',
    'option': [
      'A、拒绝服务攻击',
      'B、中间人攻击',
      'C、勒索软件攻击',
      'D、分布式拒绝服务攻击'
    ],
    'value': 'B'
  },
  {
    'title': '183、层次化的文档是信息安全管理体系（InformationSecurityManagementSystem.缩写ISMS）建设的成果之一，通常将ISMS文档结构分为4层金字塔结构，以下选项哪一类文档应放入到一级文件中（  ）',
    'option': [
      'A、风险评估报告',
      'B、机房访问安全管理规定',
      'C、内审计划',
      'D、信息安全方针'
    ],
    'value': 'D'
  },
  {
    'title': '184、关于APP数据安全，以下哪种做法是不正确的（  ）',
    'option': [
      'A、对用户数据进行加密存储',
      'B、定期备份用户数据',
      'C、防止黑客攻击和数据泄露',
      'D、将用户数据上传至第三方服务器'
    ],
    'value': 'D'
  },
  {
    'title': '185、关于SSL（安全套接层）的描述，以下哪项是错误的（  ）',
    'option': [
      'A、SSL可以为通信双方提供数据加密服务',
      'B、SSL可以确保数据的完整性和不可篡改性',
      'C、SSL协议可以保护HTTP协议免受攻击',
      'D、SSL协议可以自动识别并过滤恶意软件'
    ],
    'value': 'D'
  },
  {
    'title': '186、内容安全是我国信息安全保障工作中的一个重要环节,以下哪项不属于内容安全（  ）',
    'option': [
      'A、某在线电子杂志网站建立内容审核团队,对来稿的内容进行审核,确保无侵犯版权行为后才能在线发布',
      'B、某网站限制爬虫对网站部分内容进行爬取。',
      'C、某论坛根据相关法律要求,进行了大量的关键词过滤,使用户无法发布包含被过滤关键词的相关内容',
      'D、某网站为保证用户信息,对用户信息敏感信息如账号、口令、身份证号等进行了加密存储'
    ],
    'value': 'D'
  },
  {
    'title': '187、以下哪项数据不得开放（  ）',
    'option': [
      'A、涉及国家秘密',
      'B、商业秘密',
      'C、个人隐私',
      'D、以上都是'
    ],
    'value': 'D'
  },
  {
    'title': '188、关键信息基础设施的运营者采购网络产品和服务，可能影响国家安全的，应当通过国家网信部门会同国务院有关部门组织的（  ）',
    'option': [
      'A、国家网络审查',
      'B、国家涉密审查',
      'C、国家采购审查',
      'D、国家安全审查'
    ],
    'value': 'A'
  },
  {
    'title': '189、网络运营者应当加强对其用户发布的信息的管理，发现法律、行政法规禁止发布或者传输的信息的，应当立即停止传输该信息，采取（  ）',
    'option': [
      'A、境外存储',
      'B、委托第三方中立存储监管机构',
      'C、移交国家存储',
      'D、上报网信部门'
    ],
    'value': 'D'
  },
  {
    'title': '190、数据的单位，从小到大依次排序正确的是（  ）',
    'option': [
      'A、TB<GB<MB<KB',
      'B、MB<GB<TB<PB',
      'C、PB<TB<MB<GB',
      'D、MB<TB<EB<GB'
    ],
    'value': 'B'
  },
  {
    'title': '191、下列针对数据安全的运维要求中，正确的操作是（  ）',
    'option': [
      'A、确认需要备份的是哪些数据/数据库，设定备份与归档的策略',
      'B、从数据备份的完整性与成本方面的均衡角度考虑，增量备份结合全量备份是一个推荐的措施',
      'C、需要对备份后的数据进行恢复校验，以确保恢复后的数据可用',
      'D、以上都对'
    ],
    'value': 'D'
  },
  {
    'title': '192、降低风险（或减低风险）指通过对有风险的资产采取保护措施的方式来降低风险，下面哪个措施不属于降低风险的措施（  ）',
    'option': [
      'A、减少威胁源，采用法律的手段制裁计算机的犯罪，发挥法律的威慑作用，从而有效遏制威胁源的动机',
      'B、签订外包服务合同，将存在风险的任务通过签订外包合同给予第三方完成，通过合同条款问责应对风险',
      'C、减低威胁能力，采取身份认证措施，从而抵制身份假冒这种威胁行为的能力',
      'D、减少脆弱性，及时给系统打补丁，关闭无用的网络服务端口，从而减少系统的脆弱性，降低被利用可能'
    ],
    'value': 'B'
  },
  {
    'title': '193、人力资源部门使用一套OA系统，用于管理所有员工的各种工资、绩效考核等事宜。员工都可以登录系统完成相关需要员工配合的工作，以下哪项技术可以保证数据的保密性（  ）',
    'option': [
      'A、SSL加密',
      'B、双因子认证',
      'C、加密会话cookie',
      'D、IP地址校验'
    ],
    'value': 'A'
  },
  {
    'title': '194、《网络安全法》施行时间（  ）',
    'option': [
      'A、2017年',
      'B、2018年',
      'C、2019年',
      'D、2020年'
    ],
    'value': 'A'
  },
  {
    'title': '195、网络安全从业人员在发布技术文章时，应遵守什么原则（  ）',
    'option': [
      'A、追求点击量，无需考虑内容真实性',
      'B、随意引用他人的研究成果，无需注明出处',
      'C、确保内容真实、准确，并尊重他人的知识产权',
      'D、只发布自己的研究成果，不引用他人的内容'
    ],
    'value': 'C'
  },
  {
    'title': '196、网络运营者兼并、重组、破产的，数据承接方应承接数据安全责任和义务。没有数据承接方的，应当对数据（  ）',
    'option': [
      'A、封存',
      'B、删除',
      'C、匿名化',
      'D、存储'
    ],
    'value': 'C'
  },
  {
    'title': '197、网络安全从业人员在发布安全漏洞信息时，应遵循什么原则（  ）',
    'option': [
      'A、尽快发布，引起关注',
      'B、随意发布，无需考虑后果',
      'C、负责任的披露原则',
      'D、仅向特定群体发布'
    ],
    'value': 'C'
  },
  {
    'title': '198、下列关于网络安全法律法规的说法，错误的是（  ）',
    'option': [
      'A、网络安全法律法规旨在保障网络安全',
      'B、网络安全法律法规对违法行为有明确处罚规定',
      'C、网络安全法律法规只适用于大型企业',
      'D、网络安全法律法规要求企业和个人都要遵守'
    ],
    'value': 'C'
  },
  {
    'title': '199、在网络活动中，尊重他人的合法权益是遵循哪项原则（  ）',
    'option': [
      'A、道德原则',
      'B、经济原则',
      'C、政治原则',
      'D、法律原则'
    ],
    'value': 'D'
  },
  {
    'title': '200、关于信息安全管理，下面理解片面的是（  ）',
    'option': [
      'A、信息安全管理是组织整体管理的重要、固有组成部分，它是组织实现其业务目标的重要保障',
      'B、信息安全管理是一个不断演进、循环发展的动态过程，不是一成不变的',
      'C、信息安全建设中，技术是基础，管理是拔高，有效的管理依赖于良好的技术基础',
      'D、坚持管理与技术并重的原则，是我国加强信息安全保障工作的主要原则之一'
    ],
    'value': 'C'
  },
  {
    'title': '201、以下哪个选项是一个强密码的要求（  ）',
    'option': [
      'A、123456',
      'B、Password123',
      'C、P@$$w0rd!',
      'D、abcd'
    ],
    'value': 'C'
  },
  {
    'title': '202、下列哪种是用于保护网络免受恶意软件攻击的防御措施（  ）',
    'option': [
      'A、防火墙',
      'B、键盘加密',
      'C、网络路由器',
      'D、电子邮件'
    ],
    'value': 'A'
  },
  {
    'title': '203、通信领域一般要求3面隔离，即转发面、控制面、用户面实现物理隔离，或者是逻辑隔离，主要目的是在某一面受到攻击的时候，不能影响其他面。路由器的安全架构在实现上就支持（  ）',
    'option': [
      'A、转发面和控制面物理隔离',
      'B、控制面和用户面逻辑隔离',
      'C、转发面和用户面逻辑隔离',
      'D、以上都支持'
    ],
    'value': 'D'
  },
  {
    'title': '204、HTTPS默认端口号为（  ）',
    'option': [
      'A、21',
      'B、80',
      'C、8080',
      'D、443'
    ],
    'value': 'D'
  },
  {
    'title': '205、域名服务系统（DNS）的功能是（  ）',
    'option': [
      'A、完成域名和IP地址之间的转换',
      'B、完成域名和网卡地址之间的转换',
      'C、完成主机名和IP地址之间的转换',
      'D、完成域名和电子邮件地址之间的转换'
    ],
    'value': 'A'
  },
  {
    'title': '206、在思科设备上，若要查看所有访问表的内容，可以使用的命令式（  ）',
    'option': [
      'A、show all access-lists',
      'B、show access-lists',
      'C、show ip interface',
      'D、show interface'
    ],
    'value': 'B'
  },
  {
    'title': '207、下列哪项不是恶意软件的类型（  ）',
    'option': [
      'A、病毒',
      'B、防火墙',
      'C、间谍软件',
      'D、蠕虫'
    ],
    'value': 'B'
  },
  {
    'title': '208、什么是“虚拟专用网络”（VPN）的作用（  ）',
    'option': [
      'A、提高网络速度',
      'B、加密网络连接',
      'C、清理计算机上的病毒',
      'D、增加数据存储容量'
    ],
    'value': 'B'
  },
  {
    'title': '209、下列哪一项是arp协议的基本功能（  ）',
    'option': [
      'A、通过目标设备的IP地址，查询目标设备的MAC地址，以保证通信的进行',
      'B、对局域网内的其他机器广播路由地址',
      'C、过滤信息，将信息传递个数据链路层',
      'D、将信息传递给网络层'
    ],
    'value': 'A'
  },
  {
    'title': '210、在计算机网络中，什么是URL的作用（  ）',
    'option': [
      'A、标识网页的物理地址',
      'B、标识网页的逻辑地址',
      'C、标识网页的标题',
      'D、标识网页的作者'
    ],
    'value': 'B'
  },
  {
    'title': '211、交换机转发以太网的数据基于（  ）',
    'option': [
      'A、交换机端口号',
      'B、MAC地址',
      'C、IP地址',
      'D、数据类别'
    ],
    'value': 'B'
  },
  {
    'title': '212、以下对MAC地址描述正确的是（  ）',
    'option': [
      'A、由32位2进制数组成',
      'B、由48位2进制数组成',
      'C、前6位16进制由IEEE负责分配',
      'D、后6位16进制由IEEE负责分配'
    ],
    'value': 'B'
  },
  {
    'title': '213、以下哪种攻击是通过向目标服务器发送大量请求，使其无法处理正常请求，从而达到拒绝服务的目的（  ）',
    'option': [
      'A、SQL注入',
      'B、跨站脚本攻击',
      'C、拒绝服务攻击（DoS）',
      'D、中间人攻击'
    ],
    'value': 'C'
  },
  {
    'title': '214、攻击者通过控制多个计算机或僵尸网络来发起大规模的拒绝服务攻击，这种攻击被称为（  ）',
    'option': [
      'A、DoS',
      'B、DDoS',
      'C、ARP欺骗',
      'D、钓鱼攻击'
    ],
    'value': 'B'
  },
  {
    'title': '215、攻击者通过在目标网站上插入恶意脚本，当其他用户访问该网站时，恶意脚本会在用户的浏览器上执行，这种攻击手段称为（  ）',
    'option': [
      'A、SQL注入',
      'B、跨站脚本攻击（XSS）',
      'C、跨站请求伪造（CSRF）',
      'D、缓冲区溢出'
    ],
    'value': 'B'
  },
  {
    'title': '216、攻击者通过在应用程序的输入字段中插入或“注入”恶意的SQL代码，从而控制或操纵数据库，这种攻击手段是（  ）',
    'option': [
      'A、跨站脚本攻击',
      'B、SQL注入',
      'C、中间人攻击',
      'D、暴力破解'
    ],
    'value': 'B'
  },
  {
    'title': '217、攻击者通过伪造或篡改来自受信任方的消息，欺骗接收方执行非授权的操作，这种攻击手段称为（  ）',
    'option': [
      'A、跨站请求伪造',
      'B、钓鱼攻击',
      'C、伪装攻击',
      'D、中间人攻击'
    ],
    'value': 'A'
  },
  {
    'title': '218、攻击者利用合法用户在其计算机上执行的程序，将用户的私密信息发送到攻击者控制的服务器上，这种攻击手段是（  ）',
    'option': [
      'A、跨站脚本攻击',
      'B、钓鱼攻击',
      'C、键盘记录器攻击',
      'D、拒绝服务攻击'
    ],
    'value': 'A'
  },
  {
    'title': '219、攻击者通过猜测或穷举的方式，尝试破解用户的密码或密钥，这种攻击手段称为（  ）',
    'option': [
      'A、缓冲区溢出',
      'B、跨站请求伪造',
      'C、伪装攻击',
      'D、暴力破解'
    ],
    'value': 'D'
  },
  {
    'title': '220、攻击者通过在通信双方之间插入自己，并窃取、篡改或转发双方的通信内容，这种攻击手段是（  ）',
    'option': [
      'A、钓鱼攻击',
      'B、跨站脚本攻击',
      'C、中间人攻击',
      'D、拒绝服务攻击'
    ],
    'value': 'C'
  },
  {
    'title': '221、攻击者利用应用程序中的缓冲区溢出漏洞，执行恶意代码或控制受害者的系统，这种攻击手段称为（  ）',
    'option': [
      'A、SQL注入',
      'B、跨站请求伪造',
      'C、缓冲区溢出',
      'D、钓鱼攻击'
    ],
    'value': 'C'
  },
  {
    'title': '222、攻击者通过伪造用户的HTTP请求，以用户的身份执行非授权的操作，这种攻击手段是（  ）',
    'option': [
      'A、跨站请求伪造（CSRF）',
      'B、跨站脚本攻击',
      'C、SQL注入',
      'D、暴力破解'
    ],
    'value': 'A'
  },
  {
    'title': '223、社会工程学攻击主要利用的是（  ）',
    'option': [
      'A、技术漏洞',
      'B、人类心理',
      'C、硬件故障',
      'D、网络拥堵'
    ],
    'value': 'B'
  },
  {
    'title': '224、网络钓鱼是一种典型的社会工程学攻击手段，它通常通过什么方式诱骗用户（  ）',
    'option': [
      'A、发送大量垃圾邮件',
      'B、伪装成可信来源发送邮件或消息',
      'C、直接入侵用户电脑',
      'D、通过社交媒体发布病毒链接'
    ],
    'value': 'B'
  },
  {
    'title': '225、关于Kerberos认证过程，说法正确的是（  ）',
    'option': [
      'A、Kerberos认证过程分为三步',
      'B、Kerberos不能用于单点登录',
      'C、Kerberos采用了单向认证机制',
      'D、Kerberos认证过程中客户端要想访问服务，只需要获得到票据许可票据（TGT）'
    ],
    'value': 'A'
  },
  {
    'title': '226、DES中的非线性组件是（  ）',
    'option': [
      'A、E盒',
      'B、S盒',
      'C、P盒',
      'D、行移位'
    ],
    'value': 'B'
  },
  {
    'title': '227、当今大多数的分组密码都是（  ）',
    'option': [
      'A、仿射密码',
      'B、希尔密码',
      'C、序列密码',
      'D、乘积密码'
    ],
    'value': 'D'
  },
  {
    'title': '228、凯撒加密是一种（  ）',
    'option': [
      'A、单字母表替换',
      'B、单字母表代换',
      'C、多字母表替换',
      'D、多字母表代换'
    ],
    'value': 'A'
  },
  {
    'title': '229、假设Alice给Bob发送一条消息，并想让Bob确信该消息是由Alice发出的，则Alice应该选用（  ）',
    'option': [
      'A、Alice的公钥',
      'B、Alice的私钥',
      'C、Bob的公钥',
      'D、Bob的私钥'
    ],
    'value': 'B'
  },
  {
    'title': '230、广泛应用于商用数据保密的我国自主研制的分组密码算法是（  ）',
    'option': [
      'A、DES',
      'B、IDEA',
      'C、AES',
      'D、SM4'
    ],
    'value': 'D'
  },
  {
    'title': '231、抵御电子邮箱入侵措施中，不正确的是（  ）',
    'option': [
      'A、不用生日做密码',
      'B、不要使用少于5位的密码',
      'C、不要使用纯数字',
      'D、自己租用服务器'
    ],
    'value': 'D'
  },
  {
    'title': '232、以下关于VLAN的叙述中,错误的是（  ）',
    'option': [
      'A、VLAN把交换机划分成多个逻辑上独立的区域',
      'B、VLAN可以跨越交换机',
      'C、VLAN只能按交换机端口进行划分',
      'D、VLAN隔离了广播,可以缩小广播风暴的范围'
    ],
    'value': 'C'
  },
  {
    'title': '233、以下哪个行为可能会增加您的网络安全风险（  ）',
    'option': [
      'A、定期更换强密码',
      'B、在公共Wi-Fi网络上使用银行应用',
      'C、更新操作系统和应用程序补丁',
      'D、定期备份重要数据'
    ],
    'value': 'B'
  },
  {
    'title': '234、以下关于IPv6与IPv4报文头区别比较的说法中,错误的是（  ）',
    'option': [
      'A、IPv4的头部是变长的,IPv6的头部是定长的',
      'B、IPv6与IPv4中均有“校验和”字段',
      'C、IPv6中的HOP Limit字段作用类似于IPv4中的TTL字段',
      'D、Pv6中的Traffic Class字段作用类似于IPv4中的ToS字段'
    ],
    'value': 'B'
  },
  {
    'title': '235、到目前为止,IGMP协议一共有几个版本（  ）',
    'option': [
      'A、1',
      'B、2',
      'C、3',
      'D、4'
    ],
    'value': 'C'
  },
  {
    'title': '236、以下关于组播技术描述错误的是（  ）',
    'option': [
      'A、PIM是组播路由协议,IGMP是组播成员管理协议',
      'B、不管采取何种方式组播, 对于组播源而言, 无须知道接收者的地址信息',
      'C、与广播相比,组播只向需要数据的终端发送数据流,而不是在整个网络中泛滥,也可以有效节省网络资源',
      'D、所有D类地址都可以作为组播地址使用'
    ],
    'value': 'D'
  },
  {
    'title': '237、IPv4中，数据包传播方式不包括（  ）',
    'option': [
      'A、广播',
      'B、单播',
      'C、任播',
      'D、组播'
    ],
    'value': 'C'
  },
  {
    'title': '238、下列哪个网络设备可以根据目标IP地址选择最佳路径进行数据传输（  ）',
    'option': [
      'A、集线器',
      'B、路由器',
      'C、交换机',
      'D、网关'
    ],
    'value': 'B'
  },
  {
    'title': '239、下列哪个协议是用于在网络中发送电子邮件的（  ）',
    'option': [
      'A、FTP',
      'B、SMTP',
      'C、HTTP',
      'D、DHCP'
    ],
    'value': 'B'
  },
  {
    'title': '240、在TCP/IP 参考模型中，实现进程之间端到端通信的是（  ）',
    'option': [
      'A、物理层',
      'B、数据链路层',
      'C、网络层',
      'D、传输层'
    ],
    'value': 'D'
  },
  {
    'title': '241、Telnet 协议实现的基本功能（  ）',
    'option': [
      'A、域名解析',
      'B、文件传输',
      'C、远程登录',
      'D、密钥交换'
    ],
    'value': 'C'
  },
  {
    'title': '242、在网络互连中，在网络层实现互连的设备是（  ）',
    'option': [
      'A、网桥',
      'B、网关',
      'C、中继器',
      'D、路由器'
    ],
    'value': 'D'
  },
  {
    'title': '243、当你尝试访问一个网站时，浏览器显示“连接不安全”的警告，你应该（  ）',
    'option': [
      'A、忽略警告，继续访问网站',
      'B、立即关闭浏览器，断开网络连接',
      'C、检查网址是否正确，尝试使用其他浏览器访问',
      'D、联系网站管理员，询问安全问题'
    ],
    'value': 'C'
  },
  {
    'title': '244、在一个公司网络中，如果员工发现他们的电子邮件被篡改，包含恶意链接，这可能是哪种攻击（  ）',
    'option': [
      'A、勒索软件攻击',
      'B、邮件劫持',
      'C、钓鱼攻击',
      'D、跨站请求伪造'
    ],
    'value': 'C'
  },
  {
    'title': '245、如果你的公司突然遭受大量来自不同来源的流量攻击，导致正常业务受到影响，这可能是哪种攻击（  ）',
    'option': [
      'A、勒索软件攻击',
      'B、分布式拒绝服务攻击',
      'C、水坑攻击',
      'D、中间人攻击'
    ],
    'value': 'B'
  },
  {
    'title': '246、在网络攻击中，攻击者利用受害者计算机上的漏洞进行远程控制，这种行为通常被称为（  ）',
    'option': [
      'A、钓鱼',
      'B、远程桌面协议',
      'C、漏洞利用',
      'D、拒绝服务'
    ],
    'value': 'C'
  },
  {
    'title': '247、为了防止SQL注入攻击，以下哪种措施最为有效（  ）',
    'option': [
      'A、禁止用户输入',
      'B、使用参数化查询',
      'C、限制用户访问时间',
      'D、加密数据库连接'
    ],
    'value': 'B'
  },
  {
    'title': '248、在防御跨站脚本攻击（XSS）时，以下哪项措施是关键的（  ）',
    'option': [
      'A、禁用JavaScript',
      'B、对用户输入进行严格的验证和转义',
      'C、阻止第三方脚本的加载',
      'D、限制用户访问特定页面'
    ],
    'value': 'B'
  },
  {
    'title': '249、为了减轻分布式拒绝服务（DDoS）攻击的影响，以下哪种方法最为有效（  ）',
    'option': [
      'A、部署防火墙',
      'B、限制网站访问量',
      'C、使用DDoS缓解服务',
      'D、加密所有通信'
    ],
    'value': 'C'
  },
  {
    'title': '250、为了防止中间人攻击，以下哪种措施是必要的（  ）',
    'option': [
      'A、使用强密码',
      'B、部署SSL/TLS加密',
      'C、限制网络访问权限',
      'D、定期更新操作系统'
    ],
    'value': 'B'
  },
  {
    'title': '251、在保护企业网络免受恶意软件攻击时，以下哪项是最佳实践（  ）',
    'option': [
      'A、禁止员工下载软件',
      'B、部署防病毒软件并定期更新',
      'C、限制网络带宽',
      'D、禁止员工使用USB设备'
    ],
    'value': 'B'
  },
  {
    'title': '252、对于钓鱼攻击，以下哪种防御策略最为有效（  ）',
    'option': [
      'A、部署入侵检测系统',
      'B、提高员工安全意识',
      'C、禁止所有外部链接',
      'D、使用加密技术'
    ],
    'value': 'B'
  },
  {
    'title': '253、在保护敏感数据传输时，以下哪种加密技术最为常用（  ）',
    'option': [
      'A、MD5',
      'B、SSL/TLS',
      'C、SHA-1',
      'D、AES'
    ],
    'value': 'B'
  },
  {
    'title': '254、为了防止网络嗅探攻击，以下哪种措施是必要的（  ）',
    'option': [
      'A、使用无线网络',
      'B、加密网络通信',
      'C、禁用网络共享',
      'D、限制网络访问速度'
    ],
    'value': 'B'
  },
  {
    'title': '255、山东大学王小云教授带领的研究小组于2004年-2005年间通过快速碰撞法，令两份文件包含了不同的数据，却拥有相同的MD5值，这动摇了号称安全的哈希函数的（  ）',
    'option': [
      'A、单向性',
      'B、弱抗碰撞性',
      'C、强抗碰撞性',
      'D、不可逆性'
    ],
    'value': 'C'
  },
  {
    'title': '256、下列国密算法中，哪个是公钥密码算法（  ）',
    'option': [
      'A、SM2',
      'B、SM3',
      'C、SM4',
      'D、SM9'
    ],
    'value': 'A'
  },
  {
    'title': '257、MD5的输出长度为（  ）',
    'option': [
      'A、160',
      'B、128',
      'C、192',
      'D、256'
    ],
    'value': 'B'
  },
  {
    'title': '258、区块链是一种（  ）',
    'option': [
      'A、分布式数据库技术',
      'B、中心化数据库技术',
      'C、人工智能算法',
      'D、云计算技术'
    ],
    'value': 'A'
  },
  {
    'title': '259、以下哪种做法不能保护隐私数据（  ）',
    'option': [
      'A、将年龄值30岁的个体泛化为年龄段为30-40岁',
      'B、将原始数据中的薪资值加上一个随机的偏移量',
      'C、将原始数据集中两个不同个体的出生日期进行交换',
      'D、增加原始数据集的数据量'
    ],
    'value': 'D'
  },
  {
    'title': '260、在网络安全中，加密的主要作用是什么（  ）',
    'option': [
      'A、防止未经授权的访问',
      'B、提高网络速度',
      'C、简化网络配置',
      'D、提供更多网络带宽'
    ],
    'value': 'A'
  },
  {
    'title': '261、在网络安全中，多因素身份验证（MFA）的主要目的是什么？（  ）',
    'option': [
      'A、加快用户登录速度',
      'B、简化用户密码管理',
      'C、提高账户安全性',
      'D、监控用户活动'
    ],
    'value': 'C'
  },
  {
    'title': '262、为了体现公平公正原则，每年高考都有严格的数据防泄密措施。以下哪项是无效的数据保密手段（  ）',
    'option': [
      'A、\t封闭出卷、封闭阅卷',
      'B、试卷密封，运输过程全监控',
      'C、考生个人信息必须填入密封线以内，否则答卷无效',
      'D、出题完毕后出题组统一离场，不得交头接耳'
    ],
    'value': 'D'
  },
  {
    'title': '263、风险评估过程一般应包括（  ）',
    'option': [
      'A、\t风险分析',
      'B、风险识别',
      'C、风险评价',
      'D、以上都是'
    ],
    'value': 'D'
  },
  {
    'title': '264、设计数据安全保障方案时，以下哪个做法是错误的（  ）',
    'option': [
      'A、\t要充分切合数据安全需求并且实际可行',
      'B、要充分考虑成本效益，在满足合规性要求和风险处置要求的前提下，尽量控制成本',
      'C、要充分采取最新技术，例如积极采用基于声纹识别进行身份验证',
      'D、要充分考虑用户管理和文化的可接受性，减少系统方案实施障碍',
      'A、组织内的信息安全方针文件、信息安全规章制度文件、信息安全相关操作规范文件等文档是组织的工作标准，也是ISMS审核的依据',
      'B、组织内的业务系统日志文件、风险评估报告等文档是对上一级文件的执行和记录，对这些记录不需要保护和控制',
      'C、组织在每份文件的首页，加上文件修订跟踪表，以显示每一版本的版本号、发布日期、编写人、审批人、主要修订等内容',
      'D、多层级的文档体系是ISMS建设的直接体现，文档体系应当依据风险评估的结果建立',
      'A、网络安全和心理学',
      'B、网络安全和攻击方式',
      'C、网络安全和宗教信仰',
      'D、网络安全和漏洞利用'
    ],
    'value': 'C'
  },
  {
    'title': '267、选择系统部署的场地应考虑组织机构对信息安全的需求并将安全性放在重要的位置，此外数据资产的保护很大程度上取决于场地的安全性。在下列选项中，公司在选址时最不应该选址的场地是（  ）',
    'option': [
      'A、自然灾害较少的地区',
      'B、利用视频摄像头严格监控的独立园区',
      'C、大型医院旁',
      'D、加油站旁'
    ],
    'value': 'D'
  },
  {
    'title': '268、规范的实施流程和文档管理，是信息安全风险评估能否取得成果的重要基础，按照规范的风险评估实施流程，下面哪个文档应当是风险要素识别阶段的输出成果（  ）',
    'option': [
      'A、《风险评估方案》',
      'B、《需要保护的资产清单》',
      'C、《风险计算报告》',
      'D、《风险程度等级列表》'
    ],
    'value': 'B'
  },
  {
    'title': '269、以下关于哪种说法是错误的（  ）',
    'option': [
      'A、公司拥有安全顶尖人才，系统自研，因此安全性很高，无需再投入额外的安全费用用于应急预案',
      'B、公司制定应急演练流程应包含事件通报、事件优先级应急响应、修复后的持续观察与运维、更新应急预案等环节',
      'C、公司制定的应急预案应包含基本环境类、业务系统类、安全事件类、其他类，如发现新的安全事件类型或攻防手段，也可以更新至应急预案中',
      'D、公司应急预案对安全事件分类依据科参考GB/T20986–2023《信息安全技术网络安全事件分类分级指南》'
    ],
    'value': 'A'
  },
  {
    'title': '270、某互联网公司发现过去为了提升产品发布速度，忽略了安全性，导致发生了几起个人信息泄露事件，安全主管为了提高软件的安全性，发起了有关软件开发生命周期管理计划，下面的决策中，正确的是（  ）',
    'option': [
      'A、重要的是要在软件的编码环节采取安全措施，可以解决90%以上的安全问题。',
      'B、在需求和设计阶段就考虑数据安全控制措施。',
      'C、软件的安全测试不重要，不着急组织开发人员与第三方进行软件安全性测试',
      'D、利用敏捷开发提升软件发布效率，上线前可以忽略安全测试，而将安全测试安排在软件运行时测试，在业务非繁忙期频繁进行安全功能迭代，可以实现发布速度与安全性的均衡。'
    ],
    'value': 'B'
  },
  {
    'title': '271、某电商面向全球提供业务，某次业务中断后，该电商IT负责人召集相关人员进行反思与头脑风暴，其基础环境部门的负责任人认为电力供应是数据可访问性保障的一个重要环节,要确保电力供应不中断，且确保电力供应平稳。下列选项中,对电力供应保障不正确的是（  ）',
    'option': [
      'A、可以采用单向供电保障电力供应稳定性',
      'B、部署大规模UPS供电系统，提供持续平稳的电力供应',
      'C、可以部署电涌保护器来确保电力供应稳定性',
      'D、购置发电机，确保极端情况下供电'
    ],
    'value': 'A'
  },
  {
    'title': '272、以下哪些政务数据可以开放（  ）',
    'option': [
      'A、涉及国家秘密',
      'B、商业秘密',
      'C、个人隐私',
      'D、领导任命前的公示'
    ],
    'value': 'D'
  },
  {
    'title': '273、为保障系统的高可用性，下列措施中哪一项不是必要的（  ）',
    'option': [
      'A、使用负载均衡技术分散请求流量',
      'B、定期对服务器进行硬件维护',
      'C、仅依赖单一的通信链路进行数据传输',
      'D、实施灾难恢复计划以应对大规模故障'
    ],
    'value': 'C'
  },
  {
    'title': '274、以下数据中不属于国家核心数据的是（  ）',
    'option': [
      'A、关系国家安全的数据',
      'B、关系国民经济命脉的数据',
      'C、关系重要民生的数据',
      'D、关系公共利益的数据'
    ],
    'value': 'D'
  },
  {
    'title': '275、大数据应用所采用的技术不包括（  ）',
    'option': [
      'A、大规模存储与大规模计算',
      'B、数据的清洗与分析处理',
      'C、结合数学建模与人工智能',
      'D、以上都不对'
    ],
    'value': 'D'
  },
  {
    'title': '276、根据《电子签名法》的规定，（  ）',
    'option': [
      'A、哈希签名',
      'B、数字签名',
      'C、可靠的电子签名',
      'D、加密签名'
    ],
    'value': 'C'
  },
  {
    'title': '277、关键信息基础设施运营者采购网络产品和服务的，应当预判该产品和服务投入使用后可能带来的国家安全风险。影响或者可能影响国家安全的，应当向（  ）',
    'option': [
      'A、网络安全审查办公室',
      'B、公安部',
      'C、国家保密局',
      'D、国家安全部'
    ],
    'value': 'A'
  },
  {
    'title': '278、区块链信息服务提供者应当记录区块链信息服务使用者发布内容和日志等信息，记录备份应当保存不少于（  ）',
    'option': [
      'A、3个月',
      'B、6个月',
      'C、9个月',
      'D、12个月'
    ],
    'value': 'B'
  },
  {
    'title': '279、运营者应当建立健全网络安全保护制度和责任制，保障人力、财力、物力投入。（  ）',
    'option': [
      'A、国家网信部门',
      'B、国务院公安部门',
      'C、省级人民政府有关部门',
      'D、运营者的主要负责人'
    ],
    'value': 'D'
  },
  {
    'title': '281、运营者应当自行或者委托网络安全服务机构对关键信息基础设施每年至少进行（  ）',
    'option': [
      'A、一次',
      'B、二次',
      'C、三次',
      'D、四次'
    ],
    'value': 'A'
  },
  {
    'title': '282、网络安全等级保护2.0正式实施日期是（  ）',
    'option': [
      'A、2017年6月1日',
      'B、2019年12月1日',
      'C、2019年12月10日',
      'D、2019年5月10日'
    ],
    'value': 'B'
  },
  {
    'title': '283、关于《中华人民共和国个人信息保护法》立法宗旨，下列哪项不正确（  ）',
    'option': [
      'A、保护个人信息权益',
      'B、规范个人信息处理活动',
      'C、促进个人信息合理利用',
      'D、提升个人信息数据采集质量'
    ],
    'value': 'D'
  },
  {
    'title': '285、以下哪项属于造成信息安全问题的自然环境因素（  ）',
    'option': ['A', 'D'],
    'value': 'D'
  },
  {
    'title': '286、关于哈希函数的描述，以下哪项是错误的（  ）',
    'option': [
      'A、哈希函数将任意长度的数据映射为固定长度的输出',
      'B、哈希函数是可逆的',
      'C、哈希函数常用于验证数据的完整性',
      'D、不同的输入数据可能会产生相同的哈希值（哈希冲突）'
    ],
    'value': 'B'
  },
  {
    'title': '287、信息安全风险等级的最终因素包括（  ）',
    'option': [
      'A、威胁和脆弱性',
      'B、影响和可能性',
      'C、资产重要性',
      'D、业务稳定性'
    ],
    'value': 'B'
  },
  {
    'title': '288、自主访问控制模型（DAC）的访问控制可以用访问控制表（ACL）来表示，下面选项中说法正确的是（  ）',
    'option': [
      'A、ACL是Bell-LaPadula模型的一种具体实现',
      'B、ACL在删除用户时，去除该用户所有的访问权限比较方便',
      'C、ACL对于统计某个主体能访问哪些客体比较方便',
      'D、ACL管理或增加客体比较方便'
    ],
    'value': 'B'
  },
  {
    'title': '289、构成风险的关键因素有哪些（  ）',
    'option': [
      'A、人，财，物',
      'B、技术，管理和操作',
      'C、资产，威胁和弱点',
      'D、资产，可能性和严重性'
    ],
    'value': 'C'
  },
  {
    'title': '290、以下关于windowsSAM(安全账号管理器)的说法错误的是（  ）',
    'option': [
      'A、安全账号管理器(SAM)具体表现就是%SystemRoot%\\system32\\config\\sam',
      'B、安全账号管理器(SAM)存储的账号信息是存储在注册表中',
      'C、安全账号管理器(SAM)存储的账号信息administrator和system是可读和可写的',
      'D、安全账号管理器(SAM)是windows的用户数据库系统进程通过SecurityAccountsManager服务进行访问和操作'
    ],
    'value': 'B'
  },
  {
    'title': '291、Linux系统中，哪项内容不包含在/etc/passwd文件中（  ）',
    'option': [
      'A、用户名',
      'B、用户明文口令',
      'C、用户主目录',
      'D、用户登录后使用的SHELL'
    ],
    'value': 'B'
  },
  {
    'title': '292、哪种网络攻击方式是通过发送大量无效请求来耗尽目标系统资源，导致系统无法响应正常请求？（  ）',
    'option': [
      'A、SQL注入',
      'B、跨站脚本攻击（XSS）',
      'C、分布式拒绝服务攻击（DDoS）',
      'D、钓鱼攻击'
    ],
    'value': 'C'
  },
  {
    'title': '293、在数据安全防护中，访问权限管理至关重要。以下哪项措施是有效的访问权限控制手段（  ）',
    'option': [
      'A、为所有员工提供对所有数据的完全访问权限',
      'B、定期审查和更新用户权限',
      'C、允许员工随意共享他们的登录凭证',
      'D、仅在需要时才赋予用户必要的权限，并实行最小权限原则'
    ],
    'value': 'D'
  },
  {
    'title': '294、个人信息处理者处理不满（  ）',
    'option': [
      'A、12',
      'B、14',
      'C、16',
      'D、18'
    ],
    'value': 'B'
  },
  {
    'title': '295、境外的组织、个人从事侵害中华人民共和国公民的个人信息权益，或者危害中华人民共和国国家安全、公共利益的个人信息处理活动的，（  ）',
    'option': [
      'A、国家网信部门',
      'B、人民法院',
      'C、人民检察院',
      'D、海关'
    ],
    'value': 'A'
  },
  {
    'title': '296、个人信息处理者拒绝个人行使权利的请求的，个人可以依法向（  ）',
    'option': [
      'A、国家网信部门',
      'B、人民法院',
      'C、人民检察院',
      'D、海关'
    ],
    'value': 'C'
  },
  {
    'title': '297、网络安全中的“最小权限原则”指的是（  ）',
    'option': [
      'A、每个用户都应该拥有完全的管理权限',
      'B、用户只应拥有完成其工作所需的最小权限',
      'C、禁止所有用户访问网络',
      'D、所有用户都应该拥有数据访问权限'
    ],
    'value': 'B'
  },
  {
    'title': '298、网络安全中的“多层次防护”策略强调的是（  ）',
    'option': [
      'A、仅使用一种安全手段即可',
      'B、结合多种安全技术和措施来保护网络',
      'C、依赖外部安全服务提供商',
      'D、忽略物理安全，只关注网络安全'
    ],
    'value': 'B'
  },
  {
    'title': '299、哪种类型的攻击试图通过伪装成可信实体来窃取信息（  ）',
    'option': [
      'A、社会工程学攻击',
      'B、钓鱼攻击',
      'C、中间人攻击',
      'D、勒索软件攻击'
    ],
    'value': 'B'
  },
  {
    'title': '300、网络安全中的“数据加密”主要目的是（  ）',
    'option': [
      'A、提高网络速度',
      'B、防止数据在传输过程中被窃取或篡改',
      'C、节省存储空间',
      'D、美化数据展示格式'
    ],
    'value': 'B'
  }
]

export const ddx = [
  {
    'title': '1、下列哪些项是网络安全责任保障制（  ）',
    'option': [
      'A、谁主管谁负责',
      'B、谁使用谁负责',
      'C、谁运维谁负责',
      'D、谁立项谁负责'
    ],
    'value': 'ABC'
  },
  {
    'title': '2、以下哪些项网络攻击不会对《网络安全法》定义的网络运行安全造成影响（  ）',
    'option': [
      'A、DDOS攻击',
      'B、网页篡改',
      'C、个人信息泄露',
      'D、发布谣言信息'
    ],
    'value': 'BCD'
  },
  {
    'title': '3、以下哪些不可以作为网络安全等级保护的定级对象（  ）',
    'option': [
      'A、一台裸金属服务器，里面还没有装操作系统',
      'B、某部委部长用的PC终端',
      'C、某电商网站数据中心边界路由器',
      'D、某能源系统的能源调度云平台'
    ],
    'value': 'ABC'
  },
  {
    'title': '4、大数据发展应当全面实施国家大数据战略，坚持（  ）',
    'option': [
      'A、统筹规划、创新引领',
      'B、数据赋能、繁荣业态',
      'C、互联互通、共享开放',
      'D、行政审批、市场监督'
    ],
    'value': 'ABC'
  },
  {
    'title': '5、以下关于政务数据描述正确的有（  ）',
    'option': [
      'A、指政府部门及法律法规授权具有行政职能的组织在履行职责过程中生成或获取的的数据。',
      'B、政务数据类型包括文字、数字、图表、图像、音视频等。',
      'C、政务数据包括政务部门直接或者通过第三方依法采集、依法授权管理的和因履行职责需要依托政务信息系统形成的数据。',
      'D、政务数据中包含的个人信息可以直接参与数据交易，作为政府的新经济营收增长创新模式。'
    ],
    'value': 'ABC'
  },
  {
    'title': '6、微软提出了STRIDE模型，其中Repudiation（抵赖）的缩写，关于此项安全要求，下面描述正确的有（  ）',
    'option': [
      'A、某用户在登陆系统并下载数据后，却声称“我没有下载过数据”，这种威胁就属于Repudiation',
      'B、解决Repudiation威胁，可以选择使用抗抵赖性服务技术来解决，如强认证、数字签名、安全审计等技术措施',
      'C、Repudiation威胁是STRIDE六种威胁中第三严重的威胁，比D威胁和E威胁的严重程度更高',
      'D、解决Repudiation威胁，也应按照确定建模对象、识别威胁、评估威胁以及消减威胁等四个步骤进行'
    ],
    'value': 'ABD'
  },
  {
    'title': '7、AES在抵抗差分密码分析及线性密码分析的能力比DES更有效，已经替代DES成为新的据加密标准。其算法的信息块长度和加密密钥是可变的，以下哪些是其可能的密钥长度（  ）',
    'option': [
      'A、64bit',
      'B、128bit',
      'C、192bit',
      'D、256bit'
    ],
    'value': 'BCD'
  },
  {
    'title': '8、以下关于数据安全的预防措施或意识，说法正确的是（  ）',
    'option': [
      'A、尽量不要连接公共免费wifi',
      'B、移动硬盘拷贝数据前先进行病毒查杀',
      'C、关闭高危端口，最小化权限',
      'D、邮件内的可执行文件需要双击确认是否能运行，如果不能需要找发件人请求重新发送'
    ],
    'value': 'ABC'
  },
  {
    'title': '9、以下说法正确的是（  ）',
    'option': [
      'A、风险评估工作形式包括：自评估和检查评估；',
      'B、自评估是指信息系统拥有、运营或使用单位发起的对本单位信息系统进行风险评估；',
      'C、检查评估是信息系统上级管理部门组织或者国家有关职能部门依法开展的风险评估；',
      'D、对信息系统的风险评估方式只能是“自评估”和“检查评估”中的一个'
    ],
    'value': 'ABC'
  },
  {
    'title': '10、某公司系统受到攻击被攻击者删除了包括syslog在内的重要数据,服务器管理员给出了一些解决建议，以下哪项建议是可取的（  ）',
    'option': [
      'A、公司并无专业网络安全人员,希望出具授权书委托某网络安全公司对本次攻击进行取证',
      'B、公司缺乏备份硬盘,因此计划将恢复服务器上被删除的日志文件进行本地恢复后再提取出来进行取证',
      'C、公司缺乏备份硬盘,因此建议采购与服务器硬盘同一型号的硬盘用于存储恢复出来的数据',
      'D、公司没有专业的网络安全应急人员,因此暂时由网络管理员负责此事的应急协调工作'
    ],
    'value': 'ACD'
  },
  {
    'title': '11、关于APP数据安全，以下哪种做法是正确的（  ）',
    'option': [
      'A、对用户数据进行加密存储',
      'B、定期备份用户数据',
      'C、将用户数据上传至第三方服务器',
      'D、防止黑客攻击和数据泄露'
    ],
    'value': 'ABD'
  },
  {
    'title': '12、为保障数据可用性，系统设计时应关注（  ）',
    'option': [
      'A、网络拓扑结构是否存在单点故障',
      'B、主要网络设备以及关键业务的服务器是否冗余',
      'C、通信线路是否有多条链路',
      'D、是否有数据备份与恢复验证措施'
    ],
    'value': 'ABCD'
  },
  {
    'title': '13、降低风险（或减低风险）指通过对面的风险的资产采取保护措施的方式来降低风险，下面哪些措施可以降低风险（  ）',
    'option': [
      'A、减少威胁源，采用法律的手段制裁计算机的犯罪，发挥法律的威慑作用，从而有效遏制威胁源的动机',
      'B、签订外包服务合同，将存在风险的任务通过签订外包合同给与第三方完成，通过合同条款问责应对风险',
      'C、减低威胁能力，采取身份认证措施，从而抵制身份假冒这种威胁行为的能力',
      'D、减少脆弱性，及时给系统打补丁，关闭无用的网络服务端口，从而减少系统的脆弱性，降低被利用可能'
    ],
    'value': 'ACD'
  },
  {
    'title': '14、应用软件的数据存储在数据库中，为了保证数据安全，应设置良好的数据库防护策略，以下属于数据库防护策略的是（  ）',
    'option': [
      'A、安装最新的数据库软件安全补丁',
      'B、对存储的敏感数据进行加密',
      'C、不使用管理员权限直接连接数据库系统',
      'D、定期对数据库服务器进行重启以确保数据库运行良好'
    ],
    'value': 'ABC'
  },
  {
    'title': '15、根据《网络安全法》的规定，网络产品、服务的提供者实施哪种行为不会受到处罚（  ）',
    'option': [
      'A、提供符合相关国家标准的强制性要求的网络产品、服务；',
      'B、不在网络产品、服务中设置恶意程序；',
      'C、在规定或者当事人约定的期限内，终止提供安全维护；',
      'D、发现网络产品、服务存在安全缺陷、漏洞等风险时，立即采取补救措施，按照规定及时告知用户并向有关主管部门报告。'
    ],
    'value': 'ABD'
  },
  {
    'title': '16、在以下标准中，不属于推荐性国家标准的是（  ）',
    'option': [
      'A、GB/TXXXX.X-201X',
      'B、GBXXXX-201X',
      'C、DBXX/TXXX-201X',
      'D、GB/ZXXX-XXX-201X'
    ],
    'value': 'BCD'
  },
  {
    'title': '17、关于计算机取证描述正确的是（  ）',
    'option': [
      'A、计算机取证是使用先进的技术和工具，按照标准规程全面的检查计算机系统以提取和保护有关计算机犯罪的相关证据的活动',
      'B、取证的目的包括通过证据，查找犯罪者，通过证据推理犯罪过程，通过证据判断受害者损失程度及涉及证据提供法律支持',
      'C、电子证据是计算机系统运行过程中产生的各种信息记录及存储的电子化资料及物品，对于电子证据取证工作主要围绕证据的获取和证据的保护',
      'D、计算机取证的过程，可以分为准备，保护，提取，分析和提交五个步骤'
    ],
    'value': 'ABD'
  },
  {
    'title': '18、网络运营者包括下列哪些（  ）',
    'option': [
      'A、网络所有者',
      'B、网络管理者',
      'C、网络服务提供者',
      'D、网络使用者'
    ],
    'value': 'ABC'
  },
  {
    'title': '19、以下哪项是正确的密码管理实践（  ）',
    'option': [],
    'value': 'ABD'
  },
  {
    'title': '20、对于鱼叉攻击，下列说法正确的是（  ）',
    'option': [
      'A、以鱼叉捕鱼形象的引入到了网络攻击中，主要是指可以使欺骗性电子邮件看起来更加可信的网络钓鱼攻击，具有更高的成功可能性',
      'B、不同于撒网式的网络钓鱼，鱼叉攻击往往更加具备针对性，攻击者往往“见鱼而使叉”',
      'C、为了实现这一目标，攻击者将尝试在目标上收集尽可能多的信息。',
      'D、通常，组织内的特定个人存在某些安全漏洞。'
    ],
    'value': 'ABCD'
  },
  {
    'title': '21、企业网络安全管理中，以下哪些做法是正确的（  ）',
    'option': [
      'A、定期进行安全风险评估和审计',
      'B、忽略员工的网络安全培训需求',
      'C、建立严格的数据访问控制和权限管理机制',
      'D、及时响应和处理安全事件'
    ],
    'value': 'ACD'
  },
  {
    'title': '22、关于RAID1阵列，下列说法不正确的是（  ）',
    'option': [
      'A、必须偶数块硬盘组成',
      'B、必须两块硬盘组成',
      'C、可以提升读取性能',
      'D、可以提升写入性能'
    ],
    'value': 'ABD'
  },
  {
    'title': '23、等级保护2.0中的第四级中，安全区域边界要求：“应在网络边界通过通信协议转换或通信协议隔离等方式进行数据交换。”在通常实践中，用以下哪些设备不能实现此功能（  ）',
    'option': [
      'A、NGFW',
      'B、IDS',
      'C、IPS',
      'D、网闸'
    ],
    'value': 'ABC'
  },
  {
    'title': '24、风险评估过程一般应包括（  ）',
    'option': [
      'A、风险分析',
      'B、风险识别',
      'C、风险评价',
      'D、风险演练'
    ],
    'value': 'ABC'
  },
  {
    'title': '25、以下数据中属于国家核心数据的是（  ）',
    'option': [
      'A、关系国家安全的数据',
      'B、关系国民经济命脉的数据',
      'C、关系重要民生的数据',
      'D、关系公共利益的数据'
    ],
    'value': 'ABC'
  },
  {
    'title': '26、关于数据安全管理，以下哪些项说法合理（  ）',
    'option': [
      'A、数据安全应当全员参与',
      'B、人是薄弱的环节',
      'C、部署数据安全的产品就可以解决数据安全问题',
      'D、有必要增强数据安全意识培训'
    ],
    'value': 'ABD'
  },
  {
    'title': '27、下列针对数据安全的运维要求中，正确的操作是（  ）',
    'option': [
      'A、确认需要备份的是哪些数据/数据库，设定备份与归档的策略',
      'B、从数据备份的完整性与成本方面的均衡角度考虑，增量备份结合全量备份是一个推荐的措施',
      'C、需要对备份后的数据进行恢复校验，以确保恢复后的数据可用',
      'D、定期对数据相关风险进行评估'
    ],
    'value': 'ABCD'
  },
  {
    'title': '28、中国现行跨境法律监管体系由“1+3+N”组成，其中“3”代表下列哪些法律（  ）',
    'option': [
      'A、《个人信息保护法》',
      'B、《网络安全法》',
      'C、《数据安全法》',
      'D、《数据出境安全评估办法》'
    ],
    'value': 'ABC'
  },
  {
    'title': '29、算法推荐服务提供者提供互联网新闻信息服务的，应当遵守以下哪些义务（  ）',
    'option': [
      'A、依法取得互联网新闻信息服务许可',
      'B、规范开展互联网新闻信息采编发布服务、转载服务和传播平台服务',
      'C、不得生成合成虚假新闻信息',
      'D、不得传播非国家规定范围内的单位发布的新闻信息。'
    ],
    'value': 'ABCD'
  },
  {
    'title': '30、下列哪些属于数据跨境合规的主要难点（  ）',
    'option': [
      'A、数据体量大',
      'B、政策限制多',
      'C、属性识别难',
      'D、载体拆分难'
    ],
    'value': 'ABD'
  },
  {
    'title': '31、关于网络设备的描述，哪些是正确的（  ）',
    'option': [
      'A、交换机用于在局域网内转发数据包',
      'B、路由器用于连接不同的网络并转发数据包',
      'C、防火墙用于保护网络资源免受未经授权的访问',
      'D、服务器仅用于存储数据'
    ],
    'value': 'ABC'
  },
  {
    'title': '32、关于IP地址的说法，哪些是正确的（  ）',
    'option': [
      'A、IP地址用于唯一标识网络中的设备',
      'B、IPv4地址由32位二进制数组成',
      'C、IPv6地址长度是IPv4地址的四倍',
      'D、私有IP地址可以在互联网上直接使用'
    ],
    'value': 'ABC'
  },
  {
    'title': '33、以下哪些是网络协议（  ）',
    'option': [
      'A、TCP',
      'B、IP',
      'C、DNS',
      'D、SMTP'
    ],
    'value': 'ABCD'
  },
  {
    'title': '34、关于子网掩码的描述，哪些是正确的（  ）',
    'option': [
      'A、子网掩码的长度固定为24位',
      'B、子网掩码用于划分网络地址和主机地址',
      'C、子网掩码中的255表示该位是网络地址的一部分',
      'D、子网掩码中的0表示该位是主机地址的一部分'
    ],
    'value': 'BCD'
  },
  {
    'title': '35、关于VLAN的描述，哪些是正确的（  ）',
    'option': [
      'A、VLAN可以将一个物理网络划分为多个逻辑网络',
      'B、VLAN之间的通信必须通过路由器实现',
      'C、VLAN标签在数据包的物理层添加',
      'D、VLAN可以提高网络的安全性和管理性'
    ],
    'value': 'ABD'
  },
  {
    'title': '36、以下哪些技术属于网络安全范畴（  ）',
    'option': [
      'A、ACL（访问控制列表）',
      'B、VPN（虚拟私人网络）',
      'C、NAT（网络地址转换）',
      'D、IDS（入侵检测系统）'
    ],
    'value': 'ABD'
  },
  {
    'title': '37、防御DDoS攻击的有效措施包括哪些（  ）',
    'option': [
      'A、使用高防IP',
      'B、允许所有流量通过',
      'C、部署流量清洗设备',
      'D、定期更新服务器操作系统'
    ],
    'value': 'ACD'
  },
  {
    'title': '38、下列哪些行为可能构成网络攻击（  ）',
    'option': [
      'A、发送大量请求使目标服务器过载',
      'B、伪装成合法用户访问敏感数据',
      'C、通过正常途径购买商品',
      'D、利用漏洞远程控制目标系统'
    ],
    'value': 'ABD'
  },
  {
    'title': '39、SQL注入攻击可能导致的后果有（  ）',
    'option': [
      'A、数据泄露',
      'B、服务器崩溃',
      'C、网站内容被篡改',
      'D、网络延迟增大'
    ],
    'value': 'ABC'
  },
  {
    'title': '40、跨站脚本攻击（XSS）的防范策略包括哪些（  ）',
    'option': [
      'A、对用户输入进行过滤和转义',
      'B、禁止所有JavaScript代码执行',
      'C、使用HTTPOnly的Cookie标志',
      'D、部署防火墙拦截恶意请求'
    ],
    'value': 'ACD'
  },
  {
    'title': '41、提高网络安全性的措施包括哪些（  ）',
    'option': [
      'A、定期更新软件和操作系统',
      'B、使用弱密码或共享密码',
      'C、限制不必要的网络端口和服务',
      'D、对员工进行网络安全培训'
    ],
    'value': 'ACD'
  },
  {
    'title': '42、以下哪些属于网络攻击中常见的手段（  ）',
    'option': [
      'A、伪装成合法用户进行身份盗用',
      'B、利用漏洞进行权限提升',
      'C、通过正常渠道进行软件更新',
      'D、发送大量垃圾邮件堵塞邮箱'
    ],
    'value': 'ABD'
  },
  {
    'title': '43、关于Kerberos认证过程，说法不正确的是（  ）',
    'option': [
      'A、Kerberos认证过程分为三步',
      'B、Kerberos不能用于单点登录',
      'C、Kerberos采用了单向认证机制',
      'D、Kerberos认证过程中客户端要想访问服务，只需要获得到票据许可票据（TGT）'
    ],
    'value': 'BCD'
  },
  {
    'title': '44、根据敌手所拥有的信息不同，密码体制的攻击模型可分为（  ）',
    'option': [
      'A、唯密文攻击',
      'B、已知明文攻击',
      'C、选择密文攻击',
      'D、选择明文攻击'
    ],
    'value': 'ABCD'
  },
  {
    'title': '45、为保证密码安全，我们应采取的正确措施有（  ）',
    'option': [
      'A、不使用生日做密码',
      'B、不使用少于6位的密码',
      'C、不使用纯数字密码',
      'D、多个账号共用一个密码'
    ],
    'value': 'ABC'
  },
  {
    'title': '46、OSI模型中，（  ）',
    'option': [
      'A、物理层',
      'B、数据链路层',
      'C、网络层',
      'D、传输层'
    ],
    'value': 'CD'
  },
  {
    'title': '47、在OSI模型中，哪些层与数据的封装和解封装有关（  ）',
    'option': [
      'A、物理层',
      'B、数据链路层',
      'C、网络层',
      'D、传输层',
      'A、面向连接的',
      'B、无连接的',
      'C、可靠的',
      'D、不可靠的'
    ],
    'value': 'ABCD'
  },
  {
    'title': '49、UDP协议与TCP协议相比，有哪些不同（  ）',
    'option': [
      'A、UDP是无连接的',
      'B、UDP提供可靠的传输服务',
      'C、UDP数据包有长度限制',
      'D、UDP传输速度快',
      'A、PPP',
      'B、ARP',
      'C、IP',
      'D、ICMP'
    ],
    'value': 'ACD'
  },
  {
    'title': '51、IP协议的主要功能有哪些（  ）',
    'option': [
      'A、路由选择',
      'B、数据封装',
      'C、数据加密',
      'D、错误检测'
    ],
    'value': 'ABD'
  },
  {
    'title': '52、在保护企业数据安全方面，以下哪些措施是有效的（  ）',
    'option': [
      'A、加密敏感数据',
      'B、定期备份数据',
      'C、允许所有员工访问核心数据库',
      'D、使用强密码'
    ],
    'value': 'ABD'
  },
  {
    'title': '53、哪些行为可能构成网络犯罪（  ）',
    'option': [
      'A、未经授权访问他人计算机系统',
      'B、传播恶意软件',
      'C、合法获取并使用公开信息',
      'D、窃取他人账号密码进行非法活动'
    ],
    'value': 'ABD'
  },
  {
    'title': '54、哪些因素可能导致网络延迟（  ）',
    'option': [
      'A、网络带宽不足',
      'B、路由器配置错误',
      'C、服务器负载过高',
      'D、使用高质量的网线'
    ],
    'value': 'ABC'
  },
  {
    'title': '55、哪些措施可以提高电子邮件的安全性（  ）',
    'option': [
      'A、使用SPF和DKIM验证发件人身份',
      'B、允许所有附件自动下载并打开',
      'C、启用加密通信',
      'D、对员工进行安全意识培训'
    ],
    'value': 'ACD'
  },
  {
    'title': '56、在实施网络安全策略时，以下哪些做法是推荐的（  ）',
    'option': [
      'A、部署多层防御机制',
      'B、仅依赖单一的安全产品',
      'C、定期进行安全检查和评估',
      'D、及时更新安全补丁和策略'
    ],
    'value': 'ACD'
  },
  {
    'title': '57、以下哪些因素可能增加网络系统的脆弱性（  ）',
    'option': [
      'A、定期更新软件补丁',
      'B、使用过时的操作系统',
      'C、缺乏安全审计和监控',
      'D、员工安全意识薄弱'
    ],
    'value': 'BCD'
  },
  {
    'title': '58、根据《密码法》规定，下列属于违法犯罪行为的是（  ）',
    'option': [
      'A、发生核心密码、普通密码泄密案件',
      'B、销售或者提供未经检测认证或检测认证不合格的商用密码产品',
      'C、未经认定从事电子政务电子认证服务',
      'D、违反实施进口许可、出口管制的规定，进出口商用密码'
    ],
    'value': 'ABCD'
  },
  {
    'title': '59、在网络中传输数据，如果由于网络质量不佳或拥塞而导致丢包，此时TCP协议会采用哪些动作保障数据完整性（  ）',
    'option': [
      'A、网络拥塞时，TCP协议有拥塞控制机制，调整发送数据包的速率与流量避免拥塞',
      'B、超时重传机制，保障传输数据的完整性',
      'C、滑动窗口机制，动态适应网络变化与数据传输要求',
      'D、切换到UDP协议，尽力传输'
    ],
    'value': 'ABC'
  },
  {
    'title': '60、敏感个人信息是一旦泄露或者非法使用，容易导致自然人的人格尊严受到侵害或者人身、财产安全受到危害的个人信息，哪些属于《中华人民共和国个人信息保护法》多定义的个人敏感信息（  ）',
    'option': [
      'A、宗教信仰',
      'B、不满十四岁未成年人的个人信息',
      'C、金融账户、行踪轨迹',
      'D、医疗健康、生物特征'
    ],
    'value': 'ABCD'
  },
  {
    'title': '61、如果某业务系统定位网络安全等级保护三级，在其遭受灾难性网络攻击严重影响业务系统使用，对社会造成恐慌时，公安机关需调查取证，在取证时，应关注（  ）',
    'option': [
      'A、查看攻击的源IP',
      'B、攻击的类型',
      'C、查看相关系统的syslog日志',
      'D、查看业务系统负责人身份证'
    ],
    'value': 'ABC'
  },
  {
    'title': '62、下列哪些说法是错误的（  ）',
    'option': [
      'A、风险越大，越不需要保护',
      'B、风险越小，越需要保护',
      'C、风险越大，越需要保护',
      'D、越是中等风险，越需要保护'
    ],
    'value': 'ABD'
  },
  {
    'title': '63、微软发布了数个系统漏洞补丁，其中修复漏洞方案错误的是（  ）',
    'option': [
      'A、为了避免安全风险，马上对所有系统安装补丁',
      'B、漏洞目前还没出现利用的案例，可以暂不处理',
      'C、在测试环境中安装并确认补丁兼容性后，再于生产环境中修复',
      'D、服务器价值较高，应立即修复。用户PC价值低且没有重要数据的，是否修复由使用者自行决定'
    ],
    'value': 'ABD'
  },
  {
    'title': '64、当前大多手机终端支持指纹解锁，与传统的基于口令的鉴别技术相比，关于此种鉴别技术说法正确的是（  ）',
    'option': [
      'A、指纹便于收集、测量和比较，该系统加强了身份验证强度的同时也提升了便利性',
      'B、每个人所拥有的指纹都是独一无二的',
      'C、指纹信息是每个人独有的，具备唯一性，因此该系统没有安全问题',
      'D、该系统一般由指纹采集和指纹识别两部分组成'
    ],
    'value': 'ABD'
  },
  {
    'title': '65、灾备指标是指信息安全系统的容灾抗毁能力，主要包括以下哪些具体指标（  ）',
    'option': [
      'A、恢复时间目标（RecoveryTimeObjective,RTO）',
      'B、恢复点目标（RecoveryPointObjective,RPO）',
      'C、降级操作目标（DegradedOperationsObjective,DOO）',
      'D、网络恢复目标（NeLworkRecoveryObjective-NRO）'
    ],
    'value': 'ABCD'
  },
  {
    'title': '66、风险控制是依据风险评估的结果，选择和实施合适的安全措施。下面哪些是风险控制的方式（  ）',
    'option': [
      'A、规避风险',
      'B、转移风险',
      'C、接受风险',
      'D、降低风险'
    ],
    'value': 'ABD'
  },
  {
    'title': '67、利用“网络爬虫技术”获取公开信息时，应（  ）',
    'option': [
      'A、注意目标网站的Robots协议的具体内容和限制',
      'B、使用过程中不需要甄别“网络爬虫”收集的信息的权属',
      'C、严格管控数据采集的范围，不超范围采集',
      'D、涉及个人信息的需慎重评价'
    ],
    'value': 'ACD'
  },
  {
    'title': '68、从爬虫运行的环节分析爬虫技术的刑事违法性，下列分析错误的有（  ）',
    'option': [
      'A、违反国家规定，利用爬虫技术侵入国家事务、国防建设、尖端科学技术领域的计算机信息系统，可能构成《刑法》第二百五十三条之一规定的侵犯公民个人信息罪',
      'B、利用爬虫技术非法窃取、获取公民个人信息的，则可能构成《刑法》第二百八十五规定的非法侵入计算机信息系统罪',
      'C、利用爬虫技术侵入除国家事务、国防建设、尖端科学技术领域以外的计算机信息系统，控制该计算机信息系统，可能构成《刑法》第二百八十五条第二款规定的非法控制计算机信息系统罪',
      'D、若违反国家规定，对计算机信息系统功能进行删除、修改、增加、干扰，或者对计算机信息系统中存储、处理或者传输的数据和应用程序进行删除、修改、增加的操作，可能构成《刑法》第二百八十六条规定的破坏计算机信息系统罪'
    ],
    'value': 'AB'
  },
  {
    'title': '69、国家对公共通信和信息服务、能源、交通、水利、金融、公共服务、电子政务等重要行业和领域，以及其他一旦遭到破坏、丧失功能或者数据泄露，可能严重危害（  ）',
    'option': [
      'A、公共利益',
      'B、国计民生',
      'C、国家安全',
      'D、个人数据完整性'
    ],
    'value': 'ABC'
  },
  {
    'title': '70、关于数据安全管理，以下哪项说法正确（  ）',
    'option': [
      'A、数据安全由项目成员参与',
      'B、人是薄弱的环节',
      'C、结合信息安全管理体系是最佳实践',
      'D、有必要增强数据安全意识培训'
    ],
    'value': 'BCD'
  },
  {
    'title': '71、对于计算机口令，以下说法不正确的是（  ）',
    'option': [
      'A、尽量复杂',
      'B、可以是电话号码或生日简单好记即可',
      'C、定期更换',
      'D、多个系统用一套账号口令，能够提升工作效率'
    ],
    'value': 'BD'
  },
  {
    'title': '72、关于数据汇聚，下列说法不正确的是（  ）',
    'option': [
      'A、单条数据是脱敏的，那么汇聚数据也是非敏感的',
      'B、单条数据是脱敏的，汇聚数据可能会导致背景推理泄密',
      'C、如果单条数据脱敏，那么汇聚数据没有实际分析的意义',
      'D、数据汇聚是双刃剑，可能带来高价值数据，也可能导致泄密'
    ],
    'value': 'AC'
  },
  {
    'title': '73、关于数据库恢复技术，下列说法正确的是（  ）',
    'option': [
      'A、数据库恢复技术主要依赖备份和恢复',
      'B、日志恢复',
      'C、事务恢复',
      'D、镜像和复制'
    ],
    'value': 'ABCD'
  },
  {
    'title': '74、个人信息处理者应当定期对其处理个人信息遵守法律、行政法规的情况不包括进行（  ）',
    'option': [
      'A、安全',
      'B、合规',
      'C、数据',
      'D、信息'
    ],
    'value': 'ACD'
  },
  {
    'title': '75、根据《数据安全法》规定，提供智能化公共服务，应当充分考虑哪些人群需求，避免对他们的日常生活造成障碍（  ）',
    'option': [
      'A、老年人',
      'B、残疾人',
      'C、未成年',
      'D、孕妇'
    ],
    'value': 'AB'
  },
  {
    'title': '76、数据处理行为包括哪些（  ）',
    'option': [
      'A、数据收集',
      'B、数据存储',
      'C、数据使用',
      'D、数据传输'
    ],
    'value': 'ABCD'
  },
  {
    'title': '77、下列哪些情形中，个人信息处理者应当事前进行个人信息保护影响评估，并对处理情况进行记录（  ）',
    'option': [
      'A、处理敏感个人信息',
      'B、利用个人信息进行自动化决策',
      'C、向境外提供个人信息',
      'D、委托处理个人信息'
    ],
    'value': 'ABCD'
  },
  {
    'title': '78、哪种类型的防火墙基于用户定义的规则来允许或拒绝数据包？（  ）',
    'option': [],
    'value': 'AB'
  },
  {
    'title': '79、在网络安全中，常见的攻击类型包括哪些（  ）',
    'option': [
      'A、钓鱼攻击',
      'B、分布式拒绝服务攻击',
      'C、勒索软件攻击',
      'D、网络拥堵'
    ],
    'value': 'ABC'
  },
  {
    'title': '80、网络安全的“可用性”原则可以通过哪些措施来保障（  ）',
    'option': [
      'A、部署备份和恢复策略',
      'B、使用强密码策略',
      'C、确保系统冗余和容错性',
      'D、频繁更换网络设备'
    ],
    'value': 'AC'
  },
  {
    'title': '81、以下哪些做法有助于提高个人网络安全防护意识（  ）',
    'option': [
      'A、在公共Wi-Fi上处理敏感信息',
      'B、不轻易点击来自未知来源的链接:',
      'C、定期更新个人设备的安全补丁',
      'D、使用公共电脑处理私人事务'
    ],
    'value': 'BC'
  },
  {
    'title': '82、对于数据安全防护，访问权限管理是一项良好的安全实践，以下访问权限控制措施中合适的是（  ）',
    'option': [
      'A、严格管理数据库权限',
      'B、严格管理运维账号权限',
      'C、最好遵循三权分立原则',
      'D、对服务器主机登录权限做管控'
    ],
    'value': 'ABCD'
  },
  {
    'title': '83、对于数据安全防护，访问控制措施是一个基础的防护手段，以下哪些可以被认为是访问控制措施（  ）',
    'option': [
      'A、基于五元组的访问控制',
      'B、基于时间的访问控制',
      'C、基于角色的访问控制',
      'D、基于物理安全的'
    ],
    'value': 'ABCD'
  },
  {
    'title': '84、关于数据库恢复技术，下列说法正确的是（  ）',
    'option': [
      'A、数据库恢复技术的实现主要依靠各种数据的冗余和恢复机制技术来解决，当数据库中数据被破坏时，可以利用冗余数据来进行修复',
      'B、数据库管理员定期地将整个数据库或部分数据库文件备份到磁带或另一个磁盘上保存起来，是数据库恢复中采用的基本技术',
      'C、日志文件在数据库恢复中起着非常重要的作用，可以用来进行事务故障恢复和系统故障恢复，并协助后备副本进行介质故障恢复',
      'D、计算机系统发生故障导致数据未存储到固定存储器上，利用日志文件中故障发生前数据的循环，将数据库恢复到故障发生前的完整状态，这一对事务的操作称为提交'
    ],
    'value': 'ABC'
  },
  {
    'title': '85、应用安全，一般是指保障应用程序使用过程和结果的安全。以下内容中属于应用安全防护考虑的是（  ）',
    'option': [
      'A、身份鉴别，应用系统应对登陆的用户进行身份鉴别，只有通过验证的用户才能访问应用系统资源',
      'B、安全标记，在应用系统层面对主体和客体进行标记，主体不能随意更改权限，增加访问',
      'C、剩余信息保护，应用系统应加强硬盘、内存或缓冲区中剩余信息的保护，防止存储在硬盘、内存或缓冲区的信息被非授权的访问',
      'D、机房与设施安全，保证应用系统处于有一个安全的环境条件，包括机房环境、机房安全等级、机房的建造和机房的装修等'
    ],
    'value': 'ABC'
  },
  {
    'title': '86、下面对“零日（Zero-Day）漏洞”的理解中，不正确的是（  ）',
    'option': [
      'A、指一个特定的漏洞，该漏洞每年1月1日零点发作，可以被攻击者用来远程攻击，获取主机权限',
      'B、指通过漏洞扫描系统发现但是还没有被通告给监管机构的漏洞',
      'C、指一类漏洞，即特别好被利用，一旦成功利用该类漏洞，可以在1天内完成攻击，且成功达到攻击目标',
      'D、指一类漏洞，即刚被发现后立即被恶意利用的安全漏洞，一般来说，已经被小部分人发现，但还未公开、也不存在安全补丁的漏洞都是零日漏洞'
    ],
    'value': 'ABC'
  },
  {
    'title': '87、在对某面向互联网提供服务的某应用服务器的安全检测中发现，服务器上开放了以下几个应用，除了一个应用外其他应用都存在明文传输信息的安全问题，作为一名检测人员，你需要告诉用户对应用进行安全整改以解决明文传输数据的问题，以下哪些应用没有解决明文传输数据问题（  ）',
    'option': [
      'A、SSH',
      'B、HTTP',
      'C、FTP',
      'D、SMTP'
    ],
    'value': 'BCD'
  },
  {
    'title': '88、重要数据处理者在履行一般数据处理者数据安全保护义务的基础上，还应承担以下哪些保护义务（  ）',
    'option': [
      'A、开展数据识别备案',
      'B、加强内部管理',
      'C、组织常态化监测预警与应急处置',
      'D、定期实施风险评估'
    ],
    'value': 'ABCD'
  },
  {
    'title': '89、根据信息安全技术网络安全等级保护定级指南，等级保护对象的定级要素包括（  ）',
    'option': [
      'A、侵害行为主体',
      'B、受侵害的客体',
      'C、对客体的侵害程度',
      'D、侵害的方式'
    ],
    'value': 'BC'
  },
  {
    'title': '90、对客体的侵害外在表现为对定级对象的破坏,其侵害方式表现为对业务信息安全的破坏和对系统服务安全的破坏。业务信息安全和系统服务安全受到破坏后,可能产生以下哪些侵害后果（  ）',
    'option': [
      'A、影响行使工作职能',
      'B、导致业务能力下降',
      'C、引起法律纠纷',
      'D、导致财产损失'
    ],
    'value': 'ABCD'
  },
  {
    'title': '91、网络安全中的“零信任”原则指的是什么（  ）',
    'option': [
      'A、完全信任所有网络用户和设备',
      'B、默认不信任网络内部和外部的所有实体',
      'C、仅信任来自特定IP地址的请求',
      'D、对任何网络流量进行安全检查'
    ],
    'value': 'AD'
  },
  {
    'title': '92、对于网络钓鱼，下列说法正确的是（  ）',
    'option': [
      'A、攻击者利用欺骗性的电子邮件或伪造的Web站点等来进行网络欺诈活动',
      'B、诈骗者通常会将自己伪装成网络银行、在线零售商和信用卡公司等可信的品牌，骗取用户的私人信息或邮件账号口令',
      'C、受骗者往往会泄露自己的邮箱、私人资料，如信用卡号、银行卡账户、身份证号等内容',
      'D、只要不访问web网页，就不会被网络钓鱼'
    ],
    'value': 'ABC'
  },
  {
    'title': '93、对社会工程学描述正确的是（  ）',
    'option': [
      'A、简称社工，更注重研究人性弱点',
      'B、利用人的社会学弱点实施网络攻击的一整套方法论',
      'C、其攻击手法往往出乎人意料。可以借助黑客工具，也可以脱离黑客工具实施',
      'D、人是安全的软肋。最终导致数据泄露的原因，往往却是发生在人本身被社工攻击'
    ],
    'value': 'ABCD'
  },
  {
    'title': '94、网络安全的“保密性”原则主要通过哪些手段来实现（  ）',
    'option': [
      'A、数据加密',
      'B、访问控制',
      'C、数据备份',
      'D、物理隔离'
    ],
    'value': 'ABD'
  },
  {
    'title': '95、在风险管理中，残余风险是指实施了新的或增强的安全措施后还剩下的风险，关于残余风险，下面描述正确的是（  ）',
    'option': [
      'A、风险处理措施确定以后，应编制详细的残余风险清单，并获得管理层对残余风险的书面批准，这也是风险管理中的一个重要过程',
      'B、管理层确认接收残余风险，是对风险评估工作的一种肯定，表示管理层已经全面了解了组织所面临的风险，并理解在风险一旦变为现实后，组织能够且承担引发的后果',
      'C、接收残余风险，则表明没有必要防范和加固所有的安全漏洞，也没有必要无限制的提高安全保护措施的强度，对安全保护措施的选择要考虑到成本和技术等因素的限制',
      'D、如果残余风险没有降低到可接受的级别，则只能被动的选择接受风险，即对风险不进行下一步的处理措施，接受风险可能带来的结果。'
    ],
    'value': 'ABC'
  },
  {
    'title': '96、下列关于网络安全的说法，哪些是正确的（  ）',
    'option': [
      'A、网络安全需要综合考虑技术、管理和人员等多个方面',
      'B、网络安全法规对于保障网络安全至关重要',
      'C、个人隐私在网络中不重要，无需特别保护',
      'D、网络安全是一个不断发展的领域，需要不断更新知识'
    ],
    'value': 'ABD'
  },
  {
    'title': '97、下面哪些是系统设计阶段风险管理的工作内容（  ）',
    'option': [
      'A、安全技术选择',
      'B、软件设计风险控制',
      'C、安全产品选择',
      'D、安全需求分析'
    ],
    'value': 'ABC'
  },
  {
    'title': '98、以下哪些是记录控制的要求（  ）',
    'option': [
      'A、清晰、易于识别和检索',
      'B、记录的标识、贮存、保护、检索、保存期限和处置所需的控制措施应形成文件并实施',
      'C、建立并保持，以提供证据',
      'D、记录应尽可能的达到最详细'
    ],
    'value': 'ABC'
  },
  {
    'title': '99、信息安全管理措施包括（  ）',
    'option': [
      'A、安全策略',
      'B、物理和环境安全',
      'C、访问控制',
      'D、安全范围'
    ],
    'value': 'ABC'
  },
  {
    'title': '100、渗透测试作为网络安全评估的一部分，以下说法不正确的是（  ）',
    'option': [],
    'value': 'ABD'
  },
  {
    'title': '101、外部组织使用组织敏感信息资产时，以下错误的做法是（  ）',
    'option': [
      'A、确保使用者得到正确的信息资产',
      'B、与信息资产使用者签署保密协议',
      'C、告知信息资产使用的时间限制',
      'D、告知信息资产的重要性'
    ],
    'value': 'ACD'
  },
  {
    'title': '102、人员入职过程中，以下做法正确的是（  ）',
    'option': [
      'A、入职中签署劳动合同及保密协议',
      'B、分配工作需要的最低权限',
      'C、允许访问企业所有的信息资产',
      'D、进行安全意识培训'
    ],
    'value': 'ABD'
  },
  {
    'title': '106、以下哪些选项描述了OSI模型的特点（  ）',
    'option': [
      'A、分层结构',
      'B、每层使用下层提供的服务',
      'C、每层对其上层隐藏下层的细节',
      'D、各层之间通过接口进行通信'
    ],
    'value': 'ABCD'
  },
  {
    'title': '107、TCP/IP协议族中，哪些协议用于实现网络层的功能（  ）',
    'option': [
      'A、TCP',
      'B、IP',
      'C、ICMP',
      'D、ARP'
    ],
    'value': 'BCD'
  },
  {
    'title': '108、下列哪些是常见的网络安全攻击类型（  ）',
    'option': [
      'A、木马',
      'B、僵尸网络',
      'C、DDoS攻击',
      'D、ARP欺骗'
    ],
    'value': 'ABCD'
  },
  {
    'title': '109、在处理网络安全事件时，以下哪些做法是可取的（  ）',
    'option': [
      'A、立即关闭所有系统以防止进一步损失',
      'B、对事件进行详细的记录和分析',
      'C、通知相关人员和部门',
      'D、隐瞒事件以避免负面影响'
    ],
    'value': 'BC'
  },
  {
    'title': '110、有效的网络安全管理应包括哪些方面（  ）',
    'option': [
      'A、制定和执行网络安全政策',
      'B、定期进行安全审计和风险评估',
      'C、仅对管理层提供安全培训',
      'D、建立快速响应机制以应对安全事件'
    ],
    'value': 'ABD'
  },
  {
    'title': '111、下列哪些不能够提高网络的可用性（  ）',
    'option': [
      'A、数据冗余',
      'B、链路冗余',
      'C、软件冗余',
      'D、电源冗余'
    ],
    'value': 'ACD'
  },
  {
    'title': '112、以下哪些描述是正确的（  ）',
    'option': [
      'A、应急响应计划与应急响应这两个方面是相互补充与促进的关系',
      'B、应急响应计划为信息安全事件发生后的应急响应提供了指导策略和规程',
      'C、应急响应可能发现事前应急响应计划的不足'
    ],
    'value': 'ABC'
  },
  {
    'title': '113、信息安全属性不包括以下哪个（  ）',
    'option': [
      'A、保密性',
      'B、完整性',
      'C、可用性',
      'D、增值性'
    ],
    'value': 'ABC'
  },
  {
    'title': '114、对于信息安全风险的描述正确的是（  ）',
    'option': [
      'A、企业信息安全风险管理就是要做到零风险',
      'B、在信息安全领域，风险就是指信息资产遭受损坏并给企业带来负面影响及其潜在可能性',
      'C、风险管理就是以可接受的代价，识别、控制、减少或消除可能影响信息系统的安全风险的过程。',
      'D、风险评估就是对信息和信息处理设施面临的威胁、受到的影响、存在的弱点以及威胁发生的可能性的评估'
    ],
    'value': 'BCD'
  },
  {
    'title': '115、企业信息资产的管理和控制的描述正确的是（  ）',
    'option': [
      'A、企业应该建立和维护一个完整的信息资产清单，并明确信息资产的管控责任；',
      'B、企业应该根据信息资产的重要性和安全级别的不同要求，采取对应的管控措施；',
      'C、企业的信息资产不应该分类分级，所有的信息系统要统一对待',
      'D、企业可以根据业务运作流程和信息系统拓扑结构来识别所有的信息资产'
    ],
    'value': 'ABD'
  },
  {
    'title': '116、企业ISMS(信息安全管理体系)建设的原则包括（  ）',
    'option': [],
    'value': 'ABD'
  },
  {
    'title': '117、在应对DDoS攻击时，以下哪些策略是有效的（  ）',
    'option': [
      'A、使用高防IP',
      'B、增加服务器带宽',
      'C、忽略攻击流量',
      'D、部署流量清洗设备'
    ],
    'value': 'ABD'
  },
  {
    'title': '118、哪些做法有助于防止SQL注入攻击（  ）',
    'option': [
      'A、对用户输入进行严格的验证和过滤',
      'B、使用参数化查询',
      'C、允许所有SQL语句直接执行',
      'D、定期更新数据库管理系统'
    ],
    'value': 'ABD'
  },
  {
    'title': '119、在设置无线网络时，以下哪些做法可以提高安全性（  ）',
    'option': [
      'A、使用WPA3加密标准',
      'B、隐藏SSID',
      'C、启用MAC地址过滤',
      'D、使用默认的无线网络密码'
    ],
    'value': 'AC'
  },
  {
    'title': '120、在保护个人信息方面，以下哪些做法是正确的（  ）',
    'option': [
      'A、在公共场所随意分享个人信息',
      'B、使用安全的密码保护个人账号',
      'C、将个人信息存储在不受保护的云端',
      'D、定期检查和更新个人隐私设置'
    ],
    'value': 'BD'
  },
  {
    'title': '121、下列可用于对消息认证码进行攻击的是（  ）',
    'option': [
      'A、重放攻击',
      'B、密钥推测攻击',
      'C、查表攻击',
      'D、选择密文攻击'
    ],
    'value': 'AB'
  },
  {
    'title': '122、现代密码学主要包括（  ）',
    'option': [
      'A、数字签名',
      'B、安全协议',
      'C、公钥密码',
      'D、私钥密码'
    ],
    'value': 'BCD'
  },
  {
    'title': '123、PDCA特征的描述正确的是（  ）',
    'option': [
      'A、顺序进行，周而复始，发现问题，分析问题，然后是解决问题',
      'B、大环套小环，安全目标的达成都是分解成多个小目标，一层层地解决问题',
      'C、阶梯式上升，每次循环都要进行总结，巩固成绩，改进不足',
      'D、信息安全风险管理的思路不符合PDCA的问题解决思路'
    ],
    'value': 'ABC'
  },
  {
    'title': '124、以下哪些属于网络隐藏技术（  ）',
    'option': [],
    'value': 'ABC'
  },
  {
    'title': '125、以下哪些是VLAN的划分方式（  ）',
    'option': [
      'A、根据TCP端口来划分',
      'B、根据MAC地址来划分',
      'C、根据IP组播划分',
      'D、根据网络层划分'
    ],
    'value': 'BCD'
  },
  {
    'title': '126、定密责任人在职权范围内承担有关国家秘密的（  ）',
    'option': [
      'A、确定',
      'B、变更',
      'C、解除',
      'D、通知'
    ],
    'value': 'ABC'
  },
  {
    'title': '127、密码可以保障数据安全，但数据安全不能单纯依靠安全的密码算法、密码协议也是重要组成部分。下面描述中，正确的是（  ）',
    'option': [
      'A、在实际应用中，密码协议应按照灵活性好、可扩展性高的方式制定，不要限制和框住的执行步骤，有些复杂的步骤可以不明确处理方式。',
      'B、密码协议定义了两方或多方之间为完成某项任务而指定的一系列步骤，协议中的每个参与方都必须了解协议，且按步骤执行。',
      'C、根据密码协议应用目的的不同，参与该协议的双方可能是朋友和完全信息的人，也可能是敌人和互相完全不信任的人。',
      'D、密码协议(Cryptographicprotocol),有时也称安全协议(securityprotocol),是使用密码学完成某项特定的任务并满足安全需求的协议，其末的是提供安全服务。'
    ],
    'value': 'BCD'
  },
  {
    'title': '128、根据《密码法》规定，我国密码管理分类为（  ）',
    'option': [
      'A、核心密码',
      'B、普通密码',
      'C、商用密码',
      'D、一般密码'
    ],
    'value': 'ABC'
  },
  {
    'title': '129、下列说法错误的是（  ）',
    'option': [
      'A、对数据进行匿名化处理后，往往会产生一定程度的信息失真',
      'B、删除所有的显示标识符，可最大程度上保护个人隐私',
      'C、K-匿名技术可以有效阻止身份信息的公开与属性信息的公开',
      'D、当公开的数据有多种类型，如果他们的K-匿名方法不同，那么攻击者可以通过关联多种数据推测用户信息'
    ],
    'value': 'BC'
  },
  {
    'title': '130、一个密码体系一般分为以下哪几个部分（  ）',
    'option': [
      'A、明文',
      'B、加密密钥和解密密钥',
      'C、密文',
      'D、加密算法和解密算法'
    ],
    'value': 'ABCD'
  },
  {
    'title': '131、公钥密码体制的应用主要在于（  ）',
    'option': [
      'A、数字签名',
      'B、加密',
      'C、密钥管理',
      'D、哈希函数'
    ],
    'value': 'AC'
  },
  {
    'title': '132、数字签名的作用是（  ）',
    'option': [
      'A、确定一个人的身份',
      'B、保密性',
      'C、肯定是该人自己的签字',
      'D、使该人与文件内容有关系'
    ],
    'value': 'ACD'
  },
  {
    'title': '133、关于RAID1阵列，下列说法错误的是（  ）',
    'option': [
      'A、必须偶数块硬盘组成',
      'B、必须两块硬盘组成',
      'C、可以提升读取性能',
      'D、可以提升写入性能'
    ],
    'value': 'ABD'
  },
  {
    'title': '134、常见的反爬措施包括（  ）',
    'option': [
      'A、通过UA识别爬虫',
      'B、设置IP访问频率，如果超过一定频率，弹出验证码',
      'C、通过网络并发识别爬虫',
      'D、请求时间窗口过滤统计'
    ],
    'value': 'ABCD'
  },
  {
    'title': '135、在加固数据库时,以下哪个是数据库加固最需要考虑的（  ）',
    'option': [
      'A、修改默认配置',
      'B、规范数据库所有的表空间',
      'C、存储数据被加密',
      'D、修改数据库服务的服务端口'
    ],
    'value': 'ABC'
  },
  {
    'title': '136、以下标准内容为“信息安全管理体系要求”的是哪个（  ）',
    'option': [
      'A、ISO 27000',
      'B、ISO 27001',
      'C、ISO 27002',
      'D、ISO 27003'
    ],
    'value': 'ABCD'
  },
  {
    'title': '137、下面哪些是风险评估的过程（  ）',
    'option': [
      'A、风险因素识别',
      'B、风险程度分析',
      'C、风险控制选择',
      'D、风险等级评价'
    ],
    'value': 'ABD'
  },
  {
    'title': '138、对于计算机口令，以下说法正确的是（  ）',
    'option': [
      'A、尽量复杂',
      'B、简单好记即可',
      'C、定期更换',
      'D、多个系统用一套账号口令，能够提升工作效率'
    ],
    'value': 'BD'
  },
  {
    'title': '139、关于VPN（虚拟私人网络）的描述，以下哪些是错误的（  ）',
    'option': [
      'A、VPN允许远程用户访问本地网络资源，但不加密数据',
      'B、VPN是一种用于在公共网络上建立加密通道的技术',
      'C、VPN仅适用于大型企业',
      'D、VPN可以替代物理防火墙'
    ],
    'value': 'ACD'
  },
  {
    'title': '140、以下关于软件安全测试说法错误的是（  ）',
    'option': [
      'A、软件安全测试就是黑盒测试',
      'B、Fuzz测试是经常采用的安全测试方法之一',
      'C、软件安全测试关注的是软件的功能',
      'D、软件安全测试可以发现软件中产生的所有安全问题',
      'A、SSH',
      'B、HTTP',
      'C、FTP',
      'D、SMTP'
    ],
    'value': 'ACD'
  },
  {
    'title': '142、以下关于Windows系统的账号存储管理机制的说法哪些是错误的（  ）',
    'option': [
      'A、存储在注册表中的账号数据是管理员组用户都可以访问，具有较高的安全性',
      'B、存储在注册表中的账号数据只有administrator账户才有权访问，具有较高的安全性',
      'C、存储在注册表中的账号数据任何用户都可以直接访问，灵活方便',
      'D、存储在注册表中的账号数据有只有System账户才能访问，具有较高的安全性'
    ],
    'value': 'ABC'
  },
  {
    'title': '143、制定公司的保密协议时，以下哪些是需要考虑的内容（  ）',
    'option': [
      'A、需要保护的信息',
      'B、协议期望持续时间',
      'C、合同双方的人员数量要求',
      'D、违反协议后采取的措施'
    ],
    'value': 'ABD'
  },
  {
    'title': '144、关于冷备份和热备份，下列说法正确的是（  ）',
    'option': [
      'A、两个服务器，一台运行，一台不运行做为备份。这样一旦运行的服务器宕机，就把备份的服务器运行起来，这种方式可以称之为冷备。',
      'B、冷备的方案比较容易实现，但冷备的缺点是主机出现故障时备机不会自动接管，需要主动切换服务。',
      'C、热备：即是通常所说的active/standby方式，服务器数据包括数据库数据同时往两台或多台服务器写。当active服务器出现故障的时候，通过软件诊断（如利用心跳诊断）将standby机器激活，保证应用在短时间内完全恢复正常使用，在线实时数据丢失率很低，这是和冷备的主要区别之一。',
      'D、热备可以实现当一台服务器宕机后，自动切换到另一台备用机使用而无需人工在切换时干预，这是和冷备的主要区别之一。'
    ],
    'value': 'ABCD'
  },
  {
    'title': '145、关键信息基础设施安全保护坚持（  ）',
    'option': [
      'A、综合协调',
      'B、分工负责',
      'C、依法保护',
      'D、实时监测'
    ],
    'value': 'ABC'
  },
  {
    'title': '146、以下哪些技术是用于保护网络安全的（  ）',
    'option': [
      'A、入侵检测系统（IDS）',
      'B、Web应用防火墙',
      'C、堡垒机',
      'D、路由器'
    ],
    'value': 'ABC'
  },
  {
    'title': '147、《数据安全法》的立法目的主要包括（  ）',
    'option': [
      'A、规范数据处理活动',
      'B、保障数据安全',
      'C、促进数据开发利用',
      'D、保护个人、组织的合法权益'
    ],
    'value': 'ABCD'
  },
  {
    'title': '148、根据《网络安全法》的规定，网络运营者不得（  ）',
    'option': [
      'A、泄露',
      'B、篡改',
      'C、毁损',
      'D、使用'
    ],
    'value': 'ABC'
  },
  {
    'title': '149、下列哪些数据是国家核心数据（  ）',
    'option': [
      'A、关系国家安全的数据',
      'B、关系国民经济命脉的数据',
      'C、关系重要民生的数据',
      'D、关系重大公共利益的数据'
    ],
    'value': 'ABCD'
  },
  {
    'title': '150、以下做法正确的是（  ）',
    'option': [
      'A、严禁涉密系统一机两网',
      'B、涉密硬盘报废后可以格式化后废品回收',
      'C、用于连接互联网的PC不得处理涉密信息',
      'D、密级高的数据不得向非密系统导入'
    ],
    'value': 'ACD'
  }
]
